package com.thaddroid.apps.goodcheapeats2;

import java.util.ArrayList;
import java.util.List;
import java.util.Locale;

import com.google.android.gms.ads.*;

import android.content.Intent;
import android.graphics.Color;
import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v4.app.FragmentManager;
import android.support.v4.app.FragmentPagerAdapter;
import android.support.v4.view.ViewPager;
import android.support.v7.app.ActionBarActivity;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.ArrayAdapter;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;

public class RecipeActivity extends ActionBarActivity{
	/**
	 * The {@link android.support.v4.view.PagerAdapter} that will provide
	 * fragments for each of the sections. We use a {@link FragmentPagerAdapter}
	 * derivative, which will keep every loaded fragment in memory. If this
	 * becomes too memory intensive, it may be best to switch to a
	 * {@link android.support.v4.app.FragmentStatePagerAdapter}.
	 */
	SectionsPagerAdapter mSectionsPagerAdapter;

	/**
	 * The {@link ViewPager} that will host the section contents.
	 */
	ViewPager mViewPager;
	
	private Intent intent;
	private Bundle bundle;
	private static int whichEpidso=0, whichSeries=0;
	private AdView adView;
	private boolean firstTime=true;
	private static String recipes[][];
	private static int imageid[];
	private LinearLayout ll;
	private static int[][] numOfRecipes = {{11,8,4,8,5,6,5,7,5,5,4,4,6,4,5,4,5,5,5,5,6,6,5,7},
			{11,6,6,5,4,4,4,4,4,4,4,4,4,4,4,5,4,4,4,5}};
	
	@Override
	protected void onCreate(Bundle savedInstanceState) {
		super.onCreate(savedInstanceState);
		
		//pts = (PagerTitleStrip)findViewById(R.id.pager_title);
		
		intent = this.getIntent();
		bundle = intent.getExtras();
		
		whichEpidso = bundle.getInt("whichEpidso");
		whichSeries = bundle.getInt("whichSeries");
		
		if (whichSeries == 0) {
            setTitle(R.string.imagebutton1);
            
            switch(whichEpidso){
            
            case 0:
            recipes = new String[][]{ 
    				{ "菜名:\t雞骨粟米紅蘿蔔湯", "材料:\t雞殻、雞腳、雞頸、紅蘿蔔、粟米、西芹、洋蒽", "做法:\t1.用數片薑去為雞殻、雞腳及雞頸汆水，備用。", "2.粟米鬚打結，將所有材料切好後，放進一大鍋水中煮便成" }, 
    				{ "菜名:\t脆炸雞皮", "材料:\t雞皮", "做法:\t1.起白鍋，下雞皮後加少少油，炸至出油後隔去雞油便可上碟。", "2.稍後可以蘸醋、蒜、辣椒來吃。" }, 
    				{ "菜名:\t雞油菠菜", "材料:\t菠菜、雞皮", "做法:\t1.起白鍋，下雞皮炸至出油，隔去雞皮。", "2.在原鍋中下蒜炒香，下菠菜和鹽略炒後便可上碟。" }, 
    				{ "菜名:\t三色椒炒雞胸", "材料:\t雞胸、紅燈籠椒、綠燈籠椒、黃燈籠椒", "做法:\t1.雞胸切薄片，以油、糖、生抽和生粉略醃，備用。", "2.乾蔥、蒜、紅燈籠椒、綠燈籠椒和黃燈籠椒切絲，備用。", "3.起油鍋，下香乾蔥和蒜略炒，後下盆鹽、雞柳、紅燈籠椒、綠燈籠椒、黃燈籠椒和麻油，炒勻後上碟。" }, 
    				{ "菜名:\t青紅蘋果炒雞胸", "材料:\t雞胸、青蘋果、紅蘋果", "做法:\t1.雞胸切薄片，以油、糖、生抽和生粉略醃，備用。青蘋果、紅蘋果切粒，備用。", "2.起油鍋，炒香乾蔥和蒜後，下雞柳、青蘋果、紅蘋果、酒和生抽，炒勻後便可上碟。" }, 
    				{ "菜名:\t西式香草煎雞腿", "材料:\t雞腿、迷迭香、百里香、紅燈籠椒、綠燈籠椒、黃燈籠椒", "做法:\t1.把迷迭香和百里香切碎後，鋪滿雞腿上略醃。", "2.雞腿下胡椒粉和生抽拌勻，備用。", "3.起油鍋，下雞腿煎至一面金黃色。", "4.翻轉雞腿後，下紅燈籠椒、綠燈籠椒、黃燈籠椒、檸檬汁和胡椒鹽，炒勻後上碟，便可食用。" }, 
    				{ "菜名:\t啫啫雞翼豬肝煲", "材料:\t雞翼、豬肝、乾蔥、洋蔥、薑", "做法:\t1.豬肝去皮切薄片，備用。", "2.把薑和蒜磨成汁，備用。", "3.雞翼下生抽、酒和冬菇粉略醃。", "4.豬肝以薑汁、蒜汁、胡椒粉和鹽略醃。", "5.燒熱砂鍋，下乾蔥、蒜、洋蔥和雞翼煮至熟，下豬肝、酒、蠔油和生粉水略煮後上碟。" }, 
    				{ "菜名:\t雞腿漢堡", "菜系:\t美國菜", "材料:\t雞腿、方包、麵包糠、鮮奶、雞蛋", "做法:\t1.以攪拌器把雞肉打碎。", "2.把牛奶、方包和麵包糠以攪拌器打碎。下雞肉、胡椒粉、鹽、雞蛋和生粉拌勻成雞蓉。", "3.起油鍋，把雞蓉下鍋以中火煎香，煎至金黃色後上碟。" }, 
    				{ "菜名:\t西芹炒雞雜", "材料:\t雞雜、西芹", "做法:\t1.以酒、生抽、胡椒粉、薑汁、糖和生粉略醃雞雜。", "2.起油鍋，把雞雜略炒後盛起備用。", "3.起油鍋，下西芹、盆鹽和麻油略炒。把雞雜回鍋，下蠔油炒至全熟後上碟。" }, 
    				{ "菜名:\t蠔油王炒粒粒", "材料:\t雞腳、粟米、紅蘿蔔", "做法:\t1.把粟米和紅蘿蔔切粒，備用。", "2.起油鍋，下粟米、紅蘿蔔、蠔油、蒜、雞腳、蔥和芫荽，炒勻後上碟。" }, 
    				{ "菜名:\t意大利蛋炒桂花素翅", "材料:\t意大利蛋、芽菜、金華火腿、瑤柱、韓式粉條、西生菜", "做法:\t1.起油鍋，下芽菜和粉條，炒去當中的水分。下豉油炒勻後，盛起備用。", "2.把雞蛋、鹽、瑤柱、薑絲和蔥拌勻。", "3.起油鍋，下雞蛋、芽菜和粉條，炒至全熟後上碟，撒上火腿絲和蔥絲後，以生菜伴碟。" }
            };
            imageid = new int[]{R.drawable.image01_1, R.drawable.image01_2, R.drawable.image01_3, R.drawable.image01_4,
    					R.drawable.image01_5, R.drawable.image01_6, R.drawable.image01_7, R.drawable.image01_8,
    					R.drawable.image01_9, R.drawable.image01_10, R.drawable.image01_11};
            break;
            
            case 1:
            recipes = new String[][]{ 
    				{ "菜名:\t花生雞腳湯", "材料:\t雞腳、花生、眉豆、蜜棗", 
    					"做法:\t1.先將雞腳汆水。另外花生及眉豆要先用水浸泡過。", 
    					"2.將所有雞腳、花生、眉豆及蜜棗倒入大鍋中，然後加入沸水。", 
    					"3.然後加數片薑片，煮至出味便成。" }, 
    				{ "菜名:\t紅蘿蔔粟米豬骨湯", 
    						"材料:\t紅蘿蔔、粟米、豬骨", 
    						"做法:\t1.先將豬骨汆水，盛起後放入另一大鍋水中。", 
    						"2.然後加入打結了的粟米皮、粟米及紅蘿蔔，合上蓋煮滾至出味便成。" }, 
    				{ "菜名:\t合掌瓜雞翼湯", "材料:\t急凍雞翼、合掌瓜", "做法:\t1.起油鍋，下薑片和雞翼煎香。", "2.雞翼煎至金黃後，下合掌瓜、魚露、紹興酒、盆鹽和水。", "3.合掌瓜煮至變軟後即可上碟。" }, 
    				{ "菜名:\t番茄忌廉湯", "材料:\t番茄、洋蔥、忌廉、煙肉、茄膏", "做法:\t1.煙肉切粒，下油鍋煎香，下乾蔥和洋蔥。", "2.煮至香味四溢後，下番茄和水，煮沸後下冬菇粉、牛油和茄膏，以攪拌器打成湯，盛起後下少許忌廉，便可享用。" }, 
    				{ "菜名:\t南瓜忌廉湯", "材料:\t南瓜、忌廉、煙肉", "做法:\t1.煙肉切粒煎香，下油鍋煎香，下乾蔥和洋蔥。", "2.煮至香味四溢後，下南瓜和水，煮沸後下牛油和忌廉，以攪拌器打成湯，盛起即可食用。" }, 
    				{ "菜名:\t豆腐紅豆布丁", "材料:\t滑豆腐、魚膠片、鮮奶、紅豆", "做法:\t1.把豆腐加水以攪拌器打碎成豆腐蓉，備用。", "2.把鮮奶和糖以細火慢煮，加入豆腐蓉和預先浸軟的魚膠片。", "3.待魚膠片煮溶後，盛起隔渣。", "4.把隔渣的液體倒進容器後放涼，再放進雪櫃凝固，吃時放上紅豆即可。" }, 
    				{ "菜名:\t涼拌皮蛋蝦仁豆腐", "材料:\t硬豆腐、皮蛋、小青瓜、蝦仁、蝦米", "做法:\t1.將炸熟的豆腐整爛，以正方形的倒模將豆腐固定在碟中", "2.混合鎮江醋、老抽、少許水做成醬汁", "3.將醬汁淋上豆腐中，再加上麻油、麻醬、青瓜、蝦米、炸好的干蒽、皮蛋及蝦仁便能食用" }, 
    				{ "菜名:\t泰好味豆腐盒", "菜系:\t泰國菜", "材料:\t硬豆腐、免治豬肉、青豆角、秋葵、金不換", "做法:\t1.把豆腐炸至金黃色，盛起備用。", "2.豆角、辣椒、金不換和秋葵切粒，備用。免治豬肉、糖和魚露拌勻，備用。", "3.起油鍋，下豬肉略炒，依次序下辣椒、豆角、檸檬汁、秋葵、水和金不換，炒勻後盛起，備用。", "4.把豆腐切去一邊外層後，挖空豆腐中心，釀入已炒好的材料，放到碟中便可享用。" }
            };
            imageid = new int[]{R.drawable.image02_1, R.drawable.image02_2, R.drawable.image02_3, R.drawable.image02_4,
					R.drawable.image02_5, R.drawable.image02_6, R.drawable.image02_7, R.drawable.image02_8};
            break;
            
            case 2:
            recipes = new String[][]{  
    				{ "菜名:\t紅燒肉", "材料:\t汽水、桂皮、香葉、八角、辣椒、豬腩肉、紹興酒", "做法:\t1.豬腩肉切件。", "2.把汽水、桂皮、香葉、八角、蒜、蔥、洋蔥、冰糖、生抽、老抽、黑胡椒、醋、辣椒和紹興酒拌勻成醬汁。", "3.豬腩肉下鍋，下醬汁，以大火煮滾後，轉細火煮40分鐘，取出上碟便可食用。" }, 
    				{ "菜名:\t鹽焗烏頭", "材料:\t雞蛋、粗鹽、烏頭魚、蛋白、麵粉、檸檬", "做法:\t1.把蛋白、麵粉和粗鹽拌勻，放上烏頭魚，在魚身中放入檸檬片，以鹽覆蓋整條魚。", "2.把鹽覆蓋的烏頭魚放入200度焗爐內焗20至30分鐘，取出，除去鹽，上碟。", "3.起油鍋，下檸檬皮和檸檬汁煮至收汁成醬汁，淋於魚上。" }, 
    				{ "菜名:\t雞尾大蝦沙律", "材料:\t急凍蝦仁、沙律醬、茄汁", "做法:\t1.煮沸熱水，下蝦後關火灼10秒，盛起。", "2.把蝦放入冰水中冷凍後便可上碟。", "3.把沙律醬、茄汁和辣椒醬拌勻成醬汁，吃時可隨意蘸上。" }, 
    				{ "菜名:\t日式吉列豬排", "菜系:\t日本菜", "材料:\t丹麥去骨豬排、日本椰菜、麵包糠、橙、白飯、蛋", "做法:\t1.以刀背豬排拍薄，依次序沾上麵粉、蛋漿和麵包糠。", "2.起油鍋，下豬排炸3至4分鐘成金黃色，盛起隔油，上碟，放上椰菜和白飯伴碟。", "3.把橙搾汁，下鹽、黑胡椒和橄欖油拌勻成醬汁，吃時可隨意蘸上。" } 
            };
            imageid = new int[]{R.drawable.image03_1, R.drawable.image03_2, R.drawable.image03_3, R.drawable.image03_4};
            break;
            
            case 3:
            recipes = new String[][]{  
    				{ "菜名:\t涼拌苦瓜", "材料:\t苦瓜、話梅、冰糖", "做法:\t1.話梅和冰糖加水煮熱後，放涼後備用。", "2.苦瓜切片，放進糖水中略浸後取出放涼，放進雪櫃中冷凍。", "3.冷凍後取出上碟即可。" }, 
    				{ "菜名:\t話梅豬手", "材料:\t豬手、話梅", "做法:\t1.豬手汆水，下酒，取出後放進冷水中。", "2.把豬手放進高速煲中，下鹽、熱水、花雕酒、話梅和八角，煮約二十分鐘。", "3.取出後放涼，再放進雪櫃中冷凍。", "4.冷凍後取出便可上碟。" }, 
    				{ "菜名:\t秘製毛豆", "材料:\t毛豆、糟鹵、辣椒", "做法:\t1.毛豆先以鹽洗擦，再以水沖洗乾淨。", "2.下毛豆和水，蓋上蓋煮5分鐘取出後放進冰水內冷凍，取出後把每條毛豆的一角剪去，備用。", "3.把蒜和辣椒切碎，下糟鹵、花雕酒、花椒和八角拌勻，下毛豆拌勻，放進雪櫃中冷凍。", "4.冷凍後取出上碟便可食用。" }, 
    				{ "菜名:\t手拍小黃瓜", "材料:\t小黃瓜、蒜、辣椒、醋、豆瓣醬、酒、麻油", "做法:\t1.把蒜和辣椒切碎，黃瓜切條後放進保鮮袋內，以刀背拍碎。", "2.把蒜、辣椒、醋、酒、麻油和豆瓣醬放進保鮮袋中，和黃瓜拌勻。", "3.取出後便可上碟。" }, 
    				{ "菜名:\t金針雲耳烤麩", "菜系:\t上海菜/滬菜", "材料:\t金針、雲耳、烤麩", "做法:\t1.烤麩撕成小塊後汆水，取出後放進冰水內冷凍。", "2.取出烤麩並搾去水分。", "3.起油鍋，下烤麩炸至轉色後，取出隔油。", "4.把老抽、生抽、醋和糖下鍋，跟金針、雲耳和烤麩略煮，下麻油後關火。", "5.取出，放涼後放進雪櫃中冷凍，冷凍後取出上碟即可。" }, 
    				{ "菜名:\t肥媽餚肉", "材料:\t豬皮、豬軟骨、魚膠粉、金華火腿碎", "做法:\t1.將金華火腿蒸熟，然後切碎備用", "2.豬皮買回來後以清水洗淨後汆水，然後以水、味醂及紹興酒將豬皮煮溶，再加入魚膠粉。", "3.另外，以同樣做法但以打碎後的豬軟骨代替豬皮", "4.將豬皮漿倒入膠碗中，並加入金華火腿碎，然後放進雪柜直至凝固", "5.然後將豬骨漿倒上另外一層，再次放進雪柜至凝固。", "6.最後，從膠碗倒出後，將其切件，上碟後灑上餘下的金華火腿碎即可" }, 
    				{ "菜名:\t蒜蓉粉絲蒸魷魚", "材料:\t魷魚、牛油、蒜蓉、粉絲", "做法:\t1.起白鍋，下牛油、蒜蓉、鹽和糖略炒，炒勻後盛起，加入預先浸水的粉絲和生蒜蓉拌勻。", "2.於碟上放上蒜蓉和粉絲，再在上層放上魷魚，放進鍋中蒸10分鐘。", "3.取出後倒去水分即可上碟。" }, 
    				{ "菜名:\t黃金魷魚", "材料:\t魷魚、牛油、蒜蓉、鹹蛋、雞蛋", "做法:\t1.雞蛋下鹽拌勻，魷魚沾上蛋液和生粉。", "2.起油鍋，下魷魚炸至卷狀後盛起隔油。", "3.起油鍋，把預先蒸熟的鹹蛋黃下鍋中跟牛油炒勻，下魷魚炒勻後上碟，便可享用。" } 
            };
            imageid = new int[]{R.drawable.image04_1, R.drawable.image04_2, R.drawable.image04_3, R.drawable.image04_4,
    				R.drawable.image04_5, R.drawable.image04_6, R.drawable.image04_7, R.drawable.image04_8};
            break;
            
            case 4:
            recipes = new String[][]{
    				{ "菜名:\t豉油王素菜炒飯", "菜系:\t廣東菜/粵菜", "材料:\t冷飯、雜菜、素雞、蒜、乾蔥、辣椒", "做法:\t1.把蔬菜、蒜、乾蔥、辣椒和素雞切碎。", "2.起油鍋，下乾蔥、蒜、辣椒和素雞炒香，下冷飯、生抽、老抽、芫荽、蔥和麻油炒勻後，上碟。" }, 
    				{ "菜名:\t泰式冬蔭公炒飯", "菜系:\t泰國菜", "材料:\t冷飯、急凍蝦、南薑、檸檬葉、香茅、辣椒、草菇、乾蔥、蝦醬、魚露", "做法:\t1.把南薑、檸檬葉、香茅和辣椒搗碎。", "2.起油鍋，下搗碎的香料、乾蔥、蝦醬、糖、草菇、蝦、冷飯和魚露炒勻，炒勻後上碟。" }, 
    				{ "菜名:\t葡國海鮮炒飯", "菜系:\t葡國菜", "材料:\t冷飯、急凍海鮮粒、茄膏、雜菜、洋蔥、乾蔥、番茄、魚露", "做法:\t1.燒熱砌鍋，下油、洋蔥、乾蔥、番茄、茄膏、水和魚露。", "2.煮至冒泡後下海鮮，煮熟後盛起備用。", "3.下冷飯和牛油，煮至收汁後把海鮮回鍋炒勻。", "4.關火，撒下芹菜和蔥後便可上菜。" },
    				{ "菜名:\t印度咖喱羊炒飯", "菜系:\t印度菜", "材料:\t急凍羊肉、乾蔥、洋蔥、蒜、薑、迷迭香、黃薑粉、紅椒粉、魚露、雜菜", "做法:\t1.起油鍋，下乾蔥、洋蔥、蒜、薑和迷迭香炒香。", "2.下羊肉、黃薑粉和紅椒粉炒勻。", "3.下盆鹽、冷飯、生抽和魚露炒勻。", "4.下芫荽、辣椒和雜菜炒勻後便可上碟。" },
    				{ "菜名:\t香草葡萄烤鵪鶉", "菜系:\t法國菜", "材料:\t法國鵪鶉、鴨肝、雜米、葡萄乾、意大利番荽、羅勒葉、乾蔥頭、干邑酒、砵酒、雪莉醋、雞湯、百里香", "做法:\t1.把鵪鶉拆骨，骨放進焗爐以200度焗20分鐘，取出備用。", "2.把雜米加上湯煮沸，轉慢火再煮半小時。", "3.以牛油起鍋，下乾蔥、鵪鶉骨、砵酒和雪莉醋，煮沸後下雞湯和百里香慢煮成醬汁。", "4.另起油鍋，把鴨肝煎至金黃色後，盛起隔油，備用。", "5.以鴨肝油炒香乾蔥和葡萄乾，下干邑酒和香草，炒勻後盛起備用。", "6.把煮好的飯、葡萄乾和鴨肝拌勻，釀進鵪鶉內，並以竹籤縫好缺口和固定腿部。", "7.以鴨肝油起鍋，把鵪鶉煎至金黃色後，放進焗盤，再以180度焗20分鐘。", "8.取出後除去竹籤，淋上醬汁後即可食用。" }
            };
            imageid = new int[]{R.drawable.image05_1, R.drawable.image05_2, R.drawable.image05_3, R.drawable.image05_4,
					R.drawable.image05_5};
            break;
            
            case 5:
                recipes = new String[][]{
    				{ "菜名:\t青豆湯", "材料:\t青豆、煙肉、忌廉、長法包", "做法:\t1.首先以乾蒽及少許蒜蓉爆香煙肉，備用。", "2.青豆以清水煮熟，然後倒進煙肉中，再加入忌廉", "3.將所有東西倒入攪拌機打爛，其間加入胡椒粉、鹽及牛油調味", "4.然後將湯隔渣並倒入碗中", "5.另一方面，長法包以少許橄欖油烘一下，加點椒鹽", "6.再用生蒜在法包上磨出香味，便能伴隴湯一起進食" },
    				{ "菜名:\t香煎盲鰽伴白靈菇扒", "材料:\t白靈菇、新鮮盲鰽、馬鈴薯、檸檬、菠菜、鮮奶", "做法:\t1.起油鍋，煎香一部份魚，加入水、檸檬皮、檸檬汁、牛油、胡椒及鹽，隔去魚件，盛起魚湯備用。", "2.另起牛油鍋，放入白靈菇片、鹽、胡椒粉、檸檬皮、紹興酒，煎至金黃色", "3.以少許胡椒及鹽去醃新鮮盲鰽，再煎香。", "4.馬鈴薯切片煎香，加入白靈菇片、魚湯、芹菜段，留下備用。", "5.另起油鍋，以蒽頭及蒜炒熟菠菜，盛起備用。", "6.以牛油、生粉、忌廉／鮮奶及水調制白汁。", "7.將剛才的菠菜倒入白汁，加胡椒及鹽。", "8.最後將白汁配料倒進魚湯配料後上碟，再盲鰽放面便成。" },
    				{ "菜名:\t粉紅石榴雪葩", "材料:\t粉紅石榴、檸檬汁、黑桑子、士多啤梨", "做法:\t1.預先把石榴切粒放進雪櫃內冷凍。", "2.取出石榴粒，下檸檬汁和糖，再以攪拌器打碎成雪葩。", "3.把雪葩倒進杯中，再放上黑桑子和士多啤梨作點綴，便可食用。" },
    				{ "菜名:\t白灼豬肺", "材料:\t豬肺、芽菜、韭菜", "做法:\t1.白鍋下豬肺，煮至豬肺邊開始變金黃色後汆水，取出。", "2.把豬肺再放到白鍋中略煎，最後再汆水，盛起備用。", "3.起油鍋，下芽菜、韭菜和鹽略炒，盛起上碟。", "4.在芽菜和韭菜上放上豬肺和蔥絲，最後下少許熟油便可。" },
    				{ "菜名:\t胡椒鹹菜豬肺湯", "材料:\t豬肺、鹹菜", "做法:\t1.起油鍋，爆香薑片，加適量水、黑胡椒，並放入處理好的豬肺。", "2.滾兩小時後，取去豬喉，放入鹹菜，再滾起。", "3.最後等到鹹菜出味後便能上碟。" },
    				{ "菜名:\t川味炒豬肺", "材料:\t豬肺／豬喉、唐芹、洋蒽", "做法:\t1.將處理好的豬喉切件。", "2.起油鍋，爆香乾蒽片、蒜蓉及指天椒乾，然後再加入青尖椒、紅尖椒、洋蒽及唐芹。", "3.最後放下豬喉，加辣椒油及豉油略炒，盛起上碟。" }
                };
                imageid = new int[]{R.drawable.image06_1, R.drawable.image06_2, R.drawable.image06_3, R.drawable.image06_4,
    					R.drawable.image06_5, R.drawable.image06_6};
                break;
                
            case 6:
            	recipes = new String[][]{		
    				{ "菜名:\t奶油白汁火腿意粉", "材料:\t忌廉雞湯、火腿、意粉、芝士", "做法:\t1.把芫茜及蒽切碎放入碗中，加入黑胡椒及橄欖油。", "2.煮好意粉後，隔水倒入剛才的碗中，加入罐罐頭湯並混合，再加入少許剛才煮意粉的水。", "3.在意粉上舖上火腿及芝士，放入焗爐焗到芝士熔化便成。" },
    				{ "菜名:\t雜菜炒罐頭腸", "材料:\t罐頭腸、雜菜", "做法:\t1.起油鍋，放入洋蒽、乾蒽、腸仔、粟米粒、黑胡椒、熟蒜、鹽。", "2.炒熟後，加入三色椒粒，炒勻後上碟。" },
    				{ "菜名:\t咖哩沙甸魚", "材料:\t罐頭沙甸魚、鷹咀豆、馬鈴薯", "做法:\t1.先煎熟薯仔。", "2.另起油鍋，加入白蒽粒及番茄粒，加入黃薑粉、咖喱粉、紅椒粉、少許薑蓉、盆鹽、魚露及水做成咖喱汁。", "3.將薯仔倒入咖喱仔中，加入鷹咀豆、辣椒及沙甸魚。", "4.關火，撒下芫茜和蔥後便可上菜。" },
    				{ "菜名:\t鹹牛肉洋蔥炒滑蛋", "材料:\t鹹牛肉、洋蒽、雞蛋", "做法:\t1.起油鍋，下洋蔥及蒜炒香，加入紅椒粉、鹽、菇粉及4隻雞蛋。", "2.然後放入炒熟後的鹹牛肉炒勻後便可上碟。" },
    				{ "菜名:\t水煮牛蛙", "材料:\t牛蛙、大豆芽、萵荀、京蒽、麻辣火鍋醬、郫縣豆瓣醬", "做法:\t1.把牛蛙斬件後，加入鹽及粟粉混勻。", "2.起油鍋，將牛蛙炒至白肉後盛起備用。", "3.起油鍋，加入蒜、火鍋醬及豆瓣醬爆香，然後加入芽菜、萵荀、紅辣椒及上湯。", "4.再放入黃酒、少量糖、生抽、老抽、牛蛙、花椒粉、辣椒粉及京蒽。", "5.煮滾後便能上碟，再加上辣椒油便成。" }
            };
            	imageid = new int[]{R.drawable.image07_1, R.drawable.image07_2, R.drawable.image07_3, R.drawable.image07_4,
    					R.drawable.image07_5};
            break;
                
            case 7:
                recipes = new String[][]{    				
    				{ "菜名:\t椒鹽瀨尿蝦", "材料:\t瀨尿蝦、生蒜蓉、熟蒜蓉、辣椒、五香粉", "做法:\t1.把瀨尿蝦洗淨，印去水分後沾上生粉。", "2.起油鍋，下蝦炸至熟後，盛起備用。", "3.另起油鍋，下生蒜蓉、熟蒜蓉、辣椒、五香粉和鹽炒香，下黑胡椒炒勻後關火。", "4.下蝦，炒勻後便可上碟。" },
    				{ "菜名:\t辣酒煮花螺", "材料:\t花螺、紹興酒、辣椒、豆瓣醬、上湯", "做法:\t1.以砂鍋炒香蒜和辣椒，下上湯、紹興酒和豆瓣醬調味。", "2.下花螺，加蓋煮至全熟後便可上碟。", "3.最後放上蔥段作點綴。" },
    				{ "菜名:\t金銀蒜蒸黃金蚌", "材料:\t黃金蚌、粉絲、生蒜蓉、熟蒜蓉", "做法:\t1.以粉絲墊底，放上開邊的黃金蚌，在蚌面再放上生蒜蓉、熟蒜蓉、黑胡椒和鹽。", "2.放進鍋內蓋上蓋蒸1分半鐘。", "3.取出後便可上碟。" },
    				{ "菜名:\t薑蔥爆鮑魚", "材料:\t鮑魚、薑、蔥、蠔油", "做法:\t1.以豆粉把鮑魚清洗乾淨，切片備用。", "2.起油鍋，下薑片和蔥頭炒香，下鮑片和蠔油，炒勻後關火。", "3.放上蔥段作點綴便可上碟。" },
    				{ "菜名:\t自家製鹹水梅", "材料:\t梅子、鹽、水", "做法:\t1.除去梅蒂，在梅身上刺些小洞。", "2.在可密封的玻璃容器內間隔性的放下鹽和梅子，最後加少許蒸餾水。", "3.密封後放在陰涼地方6個月便可食用。" },
    				{ "菜名:\t梅子蒸蟹", "材料:\t鹹水梅、肉蟹、冰花梅醬、茄汁、米酒、紹興酒", "做法:\t1.鹹水梅去核，把梅子搗碎，加入茄汁、冰花梅醬、糖、豉油、米酒、水和紹興酒拌勻成醬汁。", "2.起白鍋，把醬汁煮熱。", "3.把預先洗淨切件的蟹放於碟上，再淋上已煮熱的醬汁。", "4.把蟹放到鍋內以大火蒸8至10分鐘。", "5.取出後撒下蔥花便可食用。" },
    				{ "菜名:\t私房梅子醬沙律", "材料:\t鹹水梅、沙律菜、車厘茄、無花果、小黃瓜、露筍苗、雞蛋、黑芝麻", "做法:\t1.鹹水梅去核，把梅子搗碎，另把黑芝麻搗碎和梅子拌勻，下蜜糖、陳醋和橄欖油拌勻成醬汁。", "2.把小黃瓜、車厘茄和無花果切件，下沙律菜和醬汁拌勻，上碟，最後放上預先準備的溫泉蛋和露筍苗便可食用。" }
            };
                imageid = new int[]{R.drawable.image08_1, R.drawable.image08_2, R.drawable.image08_3, R.drawable.image08_4,
    					R.drawable.image08_5, R.drawable.image08_6, R.drawable.image08_7};
            break;
                
            case 8:
                recipes = new String[][]{		
    				{ "菜名:\t琵琶豆腐", "材料:\t布包豆腐、魚膠、雞蛋、芫荽", "做法:\t1.把豆腐以湯匙壓碎，加入魚膠、芫荽、雞蛋、生粉、胡椒粉和鹽拌勻。", "2.以湯匙盛載一部份已拌勻的豆腐，在放到鍋內以猛火蒸數分鐘。", "3.蒸完後便可上碟，再放上芫荽作點綴。", "4.另起油鍋，把剩下已拌勻的豆腐下鍋煎至金黃色，上碟伴於蒸豆腐旁，便可享用。" },
    				{ "菜名:\t冬菇麥片蒸肉丸", "材料:\t冬菇、麥片、免治豬肉、米、芫荽", "做法:\t1.把免治豬肉、麥片、預先切粒的冬菇、蔥、芫荽、胡椒粉和鹽拌勻。", "2.以手把拌勻的材料搓成肉丸，再沾上預先浸泡的米，放於蒸籠內。", "3.把蒸籠放到鍋內，蒸至米全熟便可上碟。" },
    				{ "菜名:\t雪耳杏仁糊", "材料:\t美國杏仁、雪耳、牛奶、冰糖、米、白果", "做法:\t1.杏仁以熱水浸泡後去皮。", "2.起白鍋煎去杏仁的水分，並把杏仁炒香。", "3.炒香後，把杏仁、米、米水、雪耳、冰糖、牛奶和水放進攪拌器內打成糊狀。", "4.把杏仁糊倒進碗中，再放上白果作點綴便可食用。" },
    				{ "菜名:\t豆卜花枝繡球伴洛神花汁", "材料:\t墨魚滑、豆卜、荸薺、洛神花乾、番茄汁、豉油", "做法:\t1.預先把洛神花乾浸軟，把浸軟的洛神花乾和浸泡過的水倒進鍋中，再加入糖、茄汁、豉油煮熱。", "2.煮熱後加入生粉水，煮成醬汁，備用。", "3.把墨魚滑和荸薺拌勻，釀進開邊的豆卜內。", "4.起油鍋，下豆卜炸至變大和浮起後，盛起隔油，備用。", "5.起油鍋，下炸好的豆卜。轉大火，下醬汁炒勻後上碟。" },
    				{ "菜名:\t洛神花茶", "材料:\t紅酒、洛神花乾", "做法:\t1.預先把洛神花乾浸軟，把浸軟的洛神花乾和浸泡過的水倒進鍋中，再加水、紅酒和糖煮30至45分鐘。", "2.以容器盛起放涼後，放到雪櫃內儲存。", "3.取出少許冷凍了的洛神花蜜，放進熱水內拌勻便可飲用。" }
            };
                imageid = new int[]{R.drawable.image09_1, R.drawable.image09_2, R.drawable.image09_3, R.drawable.image09_4,
    					R.drawable.image09_5};
            break;
                    
            case 9:
                recipes = new String[][]{    				
    				{ "菜名:\t肥媽喇沙", "菜系:\t馬來西亞菜/馬拉菜", "材料:\t瀨粉、素鰻魚、素雞、豆卜、斑蘭葉、南薑、香茅、蝦乾、椰汁", "做法:\t1.把南薑、香茅、蝦乾和水以攪拌器打成醬汁，備用。", "2.起油鍋，素鰻魚和素雞切件下鍋煎香，盛起備用。", "3.另起油鍋，下乾蔥和香茅略煮，下醬汁和黃薑粉煮勻，下斑蘭葉和菜湯，加蓋煮。", "4.除去蓋後下椰汁、瀨粉、豆卜、辣椒絲、芫荽和蔥，煮勻後便可上碟。", "5.最後放上素鰻魚、素雞和花生便可品嚐。" },
    				{ "菜名:\t峇里醬銀針粉", "菜系:\t印尼菜", "材料:\t銀針粉、瘦肉、蝦米、辣椒、乾蔥、蒜頭", "做法:\t1.起油鍋，把乾蔥和蝦米切粒下鍋，略炒，下辣椒粒和蒜蓉炒勻成醬汁，盛起備用。", "2.瘦肉切絲以油、生粉、豉油和糖略醃，備用。", "3.起油鍋，下瘦肉絲、醬汁和預先煮熟的銀針粉炒勻。", "4.下豉油、芫荽和蔥，炒勻後便可上碟。" },
    				{ "菜名:\t肉絲兩面黃", "材料:\t蛋麵、瘦肉", "做法:\t1.把蛋麵煮熟後以冷水沖洗後，隔水備用。 ", "2.起油鍋，下蛋麵回煎，把蛋麵煎至底面香脆後翻轉。", "3.把另一面煎至香脆後上碟。", "4.瘦肉切絲以油、生粉、豉油和糖略醃。", "5.起油鍋下，瘦肉絲、薑絲、椒絲和蔥絲炒香，下蠔油和芡汁炒勻後放於麵上。", "6.最後伴上鎮江醋，吃時可隨意蘸上。" },
    				{ "菜名:\t三色冷麵", "材料:\t菠菜麵、素麵、蛋麵、麻醬、檸檬、雜菜", "做法:\t1.把蛋麵、素麵和菠菜麵煮熟後以冷水沖洗後，隔水上碟。", "2.把雜菜切絲伴碟。", "3.把檸檬皮、檸檬汁、蜜糖、生抽、麻醬和麻油拌勻成醬汁，伴於麵碟旁。", "4.吃時把所有材料和醬汁拌勻，撒上花生、乾蔥碎和蔥便可進食。" },
    				{ "菜名:\t梅子煎鱒魚", "材料:\t金鱒魚、澳洲菠菜苗、中國酸梅、檸檬、牛油、蜜糖", "做法:\t1.抹乾魚身的水份，在魚肚內下鹽和胡椒粉。", "2.起油鍋，下魚，每邊煎3分鐘。", "3.同時在鍋中把蒜煎香，並把蒜和牛油放到魚肚中。", "4.把魚翻轉後下梅子、檸檬和檸檬汁。", "5.上碟前下蜜糖略煎便可。", "6.魚上碟後原鍋下菠菜略煮30秒便可上碟，放於魚上。" }
            };
                imageid = new int[]{R.drawable.image010_1, R.drawable.image010_2, R.drawable.image010_3, R.drawable.image010_4,
    					R.drawable.image010_5};
            break;
                    
            case 10:
                recipes = new String[][]{		
    				{ "菜名:\t混醬鴨", "材料:\t急凍米鴨、柱侯醬、麻醬、磨豉醬、南乳、海鮮醬、冰糖、香葉", "做法:\t1.把柱侯醬、麻醬、磨豉醬和南乳拌勻成醬料，備用。", "2.起油鍋，下薑片和紫洋蔥炒香，盛起備用。", "3.下鴨，加蓋，煎至四面金黃色，盛起備用。", "4.起油鍋，下醬料、海鮮醬、糖、薑片和紫洋蔥略炒，下水和鴨，加蓋轉細火慢煮。", "5.煮滾後下老抽、冰糖和香葉。", "6.把所有材料放進電子鍋中煮至全熟。", "7.從電子鍋中取出鴨，上碟，淋上醬汁便可食用。" },
    				{ "菜名:\t南乳炆豬手", "材料:\t豬手、南乳、蓮藕、冰糖", "做法:\t1.豬手汆水，盛起以冷水沖洗，瀝乾備用。", "2.起油鍋，把南乳、黃糖、水拌勻下鍋，慢煮至收汁。", "3.下豬手略煮，下蓮藕，轉細火加蓋慢煮。", "4.煮滾後下冰糖，以中火炆。", "5.煮至蓮藕變軟後下老抽，煮勻後便可上碟享用。" },
    				{ "菜名:\t蝦醬啫啫生菜煲", "材料:\t生菜、蝦醬、蒜蓉", "做法:\t1.起油鍋，把蒜蓉、蝦醬、糖和水拌勻下鍋，煮熱。", "2.把砂鍋燒熱，關火，先放下生菜，下煮熱的蝦醬，炒勻，撒上紅椒絲便可。" },
    				{ "菜名:\t芝士蟹肉意式雲吞", "菜系:\t意大利菜", "材料:\t雞蛋、檸檬、番茄、羅勒葉、罐頭蟹肉、Ricotta芝士、巴馬臣芝士、Semola麵粉", "做法:\t1.把Semola麵粉、雞蛋、海鹽和水拌勻成麵糰。", "2.在桌上灑上麵粉，放上麵糰不停搓揉。", "3.以木棒把麵糰壓扁，以圓形模切出粉糰成雲吞皮，備用。", "4.起油鍋，下蒜頭、羅勒葉和番茄粒，煮滾後轉細火煮20分鐘，再以攪拌器打成醬汁，備用。", "5.把Ricotta芝士、蟹肉、巴馬臣芝士、鹽、黑胡椒和檸檬絲拌勻成餡料，備用。", "6.雲吞皮抹上蛋液，放上餡料，再放上另一雲吞皮，封好缺口便成了雲吞。", "7.鍋中下水煮滾，下雲吞煮2分鐘。", "8.在碟上放上少許醬汁，放上煮熟的雲吞，再淋上醬汁和巴馬臣芝士便可享用。" }
            };
                imageid = new int[]{R.drawable.image011_1, R.drawable.image011_2, R.drawable.image011_3, R.drawable.image011_4};
        				
            break;
                    
            case 11:
                recipes = new String[][]{		
    				{ "菜名:\t鹽燒三文魚頭", "菜系:\t日本菜", "材料:\t三文魚頭、五香粉、鹽、胡椒粉", "做法:\t1.把三文魚頭洗淨，以紙巾把水份抹乾，下五香粉、胡椒粉和鹽略醃。", "2.把魚頭以光波爐烤至兩面香脆。", "3.取出魚頭，上碟便可食用。" },
    				{ "菜名:\t三文魚骨湯", "菜系:\t日本菜", "材料:\t三文魚骨、煙肉、紅蘿蔔、洋蔥、芹菜、京蔥、韭黃、檸檬、味醂、魚露", "做法:\t1.燒熱砂鍋，下煙肉粒和蔥略炒。", "2.下紅蘿蔔、洋蔥、檸檬皮、水、味醂、魚露、胡椒和盆鹽略煮成湯。", "3.另起油鍋，把三文魚骨切件下鍋煎香。", "4.把煎香的三文魚骨放到湯中，下芹菜、京蔥、韭黃和檸檬汁，略煮後便可把砂鍋上桌。" },
    				{ "菜名:\t三文魚飯糰", "菜系:\t日本菜", "材料:\t三文魚骨、紫菜、檸檬、冷飯", "做法:\t1.起油鍋，把三文魚骨切件下鍋煎香，盛起備用。", "2.把三文魚骨起肉後，下冷飯、檸檬汁、糖、鹽和胡椒拌勻，再以手搓揉成飯糰。", "3.以紫菜包著三文魚飯糰，放上碟後便可隨時享用。" },
    				{ "菜名:\t鴛鴦蝦多士", "菜系:\t廣東菜/粵菜", "材料:\t新鮮海中蝦、方包、雞蛋、腐皮、紫菜、芝麻", "做法:\t1.蝦去頭去殼，取出蝦肉。把蝦肉、蛋白、粟粉和水打成蝦膠，放到雪櫃冷凍半小時。", "2.取出蝦膠，並略撻蝦膠。把麵包沾上蛋液，再抹上蝦膠，備用。如喜歡亦可在蝦膠上撒上芝麻。", "3.腐皮抹上蛋液，放上紫菜，再抹上蝦膠，把腐皮卷成壽司狀，備用。", "4.起油鍋，下麵包蝦多士，先煎蝦的一面。煎至兩面金黃後取出，以隔油紙吸去油份，備用。", "5.起油鍋，下腐皮蝦多士，要把蝦多士不停轉動以免變焦，煎至熟後便可盛起，以隔油紙吸去油份，備用。", "6.把腐皮蝦多士和麵包蝦多士切件上碟便可食用。" }
            };
                imageid = new int[]{R.drawable.image012_1, R.drawable.image012_2, R.drawable.image012_3, R.drawable.image012_4};
        				
            break;
                    
            case 12:
                recipes = new String[][]{		
    				{ "菜名:\t紅棗蛋茶", "材料:\t紅棗、雞蛋、薑片", "做法:\t1.把雞蛋烚熟。", "2.薑片、水下鍋才開火，下紅棗和蛋。", "3.煮至雞蛋變色後便可上碟食用。" },
    				{ "菜名:\t鮮淮山炒雞翼", "材料:\t鮮淮山、雞翼、紅蘿蔔", "做法:\t1.起白鍋，以中火煎雞翼。煎至雞翼出油份後下蔥、紅蘿蔔片和淮山片略炒。", "2.下調味料炒勻後便可上碟。" },
    				{ "菜名:\t鮮蟲草花蝦乾勝瓜煲", "材料:\t鮮蟲草花、勝瓜、蝦乾、魚露、麻油、乾蔥、蒜、香菇粉", "做法:\t1.燒熱砂鍋，下蝦乾、乾蔥和蒜炒香。", "2.下勝瓜、水、魚露、麻油、蟲草花和香菇粉略煮。", "3.煮滾後便可上碟享用。" },
    				{ "菜名:\t天山雪蓮鮮果沙律", "材料:\t天山雪蓮果、青蘋果、紅蘋果、檸檬、蜜糖、橄欖油、薄荷葉、黑胡椒、胡椒粉、鹽、豉油、番荽", "做法:\t1.天山雪蓮果去皮，切條，青蘋果、紅蘋果切條，備用。", "2.把檸檬皮、蜜糖、橄欖油、薄荷葉、黑胡椒、胡椒粉、鹽、豉油和檸檬汁拌勻成醬汁。", "3.把所有蔬果和醬汁拌勻，便可上碟，最後放上車厘茄和番荽作點綴。" },
    				{ "菜名:\t南瓜莎莎伴薯片", "材料:\t南瓜、芫荽粉、紅椒粉、胡椒粉、蛋黃醬、羅勒葉、薯片", "做法:\t1.南瓜去籽，隔水蒸20分鐘。", "2.起南瓜蓉，下蛋黃醬、芫荽粉、紅椒粉、胡椒粉、鹽和羅勒葉拌勻。", "3.把南瓜蓉上碟，插上薯片，食時以薯片盛著南瓜蓉一同品嚐。" },
    				{ "菜名:\t酥炸南瓜球", "材料:\t焗薯、雞蛋、麵包糠、免治豬肉、荸薺、蝦米、蒜", "做法:\t1.南瓜和馬鈴薯預先蒸熟，壓成薯蓉和南瓜蓉，備用。", "2.起油鍋，下蒜蓉、蝦米和糖略炒，下已調味的免治豬肉和荸薺粒，炒熟成餡料，盛起備用。", "3.薯蓉、南瓜蓉、粟粉、黑胡椒和鹽拌勻。", "4.取少許薯蓉和南瓜蓉放到手中，放入餡料，搓揉成球狀。", "5.把南瓜球依序沾上蛋液和麵包糠，再放到油鍋內炸至金黃色，盛起隔油。", "6.先在碟上放上點綴的紫蘇葉和醬汁，把南瓜球切半上碟便可。" }
            };
                imageid = new int[]{R.drawable.image013_1, R.drawable.image013_2, R.drawable.image013_3, R.drawable.image013_4,
    					R.drawable.image013_5, R.drawable.image013_6};
            break;
                    
            case 13:
                recipes = new String[][]{		
    				{ "菜名:\t冰鎮海鮮拼盤", "材料:\t青口、海蝦、珍珠蚌、刺螺、蟶子、小象拔蚌、蜆、芹菜、洋蔥、紫洋蔥、紅蘿蔔、檸檬、鹽、胡椒粉、紹興酒", "做法:\t1.把所有海鮮清洗乾淨，備用。", "2.水煮滾，下芹菜、洋蔥、紫洋蔥、紅蘿蔔、檸檬、鹽、胡椒粉和紹興酒略煮。", "3.下海鮮，略煮後盛起隔水放涼。", "4.在大盤上放滿冰，放上海鮮，最後放上椒絲和檸檬作點綴。", "5.蔥頭、指天椒、魚露、辣椒和番茄以攪拌器打勻成醬汁伴於碟旁，吃時可隨意蘸上。" },
    				{ "菜名:\t鴛鴦腸仔酥皮卷", "材料:\t急凍香腸、酥皮、雞蛋、洋蔥、檸檬皮、乾蔥、蒜、蛋黃、黃芥末、士多啤梨", "做法:\t1.酥皮放上香腸卷成條狀，切件。", "2.焗盤鋪上牛油紙再放上香腸卷，在香腸卷上抹上蛋液，備用。", "3.香腸、洋蔥、乾蔥、蒜、蛋黃和檸檬皮以攪拌器打成餡料。", "4.餡料下黃芥末拌勻，放到酥皮上卷成條狀，在酥皮卷頂部輕切兩刀，放在焗盤上。", "5.把焗盤放到220度焗爐內焗20分鐘。", "6.取出後放上士多啤梨作點綴。" },
    				{ "菜名:\t話梅雞尾酒", "材料:\t甜話梅、花雕酒、薄荷葉、冰糖", "做法:\t1.冰糖以刀背拍碎，放到鍋內加水煮滾，下話梅略煮成話梅汁，關火放涼。", "2.薄荷葉切碎，下花雕酒、話梅汁和冰拌勻，倒進瓶內，喝時可倒出飲用。" },
    				{ "菜名:\t泮塘鳳凰蛋", "菜系:\t廣東菜/粵菜", "材料:\t雞蛋、菜脯粒、洋蔥、青燈籠椒、紅燈籠椒、黃燈籠椒、荸薺、鮮百合、番茄汁、米醋", "做法:\t1.起油鍋，下雞蛋以慢火煎7至8分鐘，期間在蛋上放上菜脯粒。", "2.把雞蛋底部煎熟後翻轉另一面再煎，煎至全熟後盛起，備用。", "3.以圓形模吸出圓形的雞蛋，備用。", "4.把茄汁、砂糖、醋和水拌勻成醬汁，備用。", "5.起油鍋，下洋蔥、青燈籠椒、紅燈籠椒和黃燈籠椒略炒，下醬汁和生粉水，煮至收汁後下雞蛋，炒勻便可上碟。", "6.起油鍋，下荸薺粒、鮮百合粒和鹽略炒，放於蛋上，再放上芫荽作點綴。" }
            };
                imageid = new int[]{R.drawable.image014_1, R.drawable.image014_2, R.drawable.image014_3, R.drawable.image014_4};
            break;
                    
            case 14:
                recipes = new String[][]{		
    				{ "菜名:\t雜錦Pizza", "菜系:\t意大利菜", "材料:\t意大利青瓜、茴香、麵粉、芝士、番茄、青椒、紅椒、黃椒、香草、雞翼、叉燒", "做法:\t1.把麵粉和酵母發酵成麵糰，搓揉成Pizza餅底。", "2.番茄以攪拌器打成茄汁，備用。", "3.起油鍋，下香草碎、蔥頭、茄汁和茄膏煮成醬汁，盛起備用。", "4.意大利青瓜切條，茴香切片，雞翼去骨並撕成雞肉，備用。", "5.Pizza餅底上抹上醬汁，放上雞肉、叉燒、意大利青瓜、茴香、青椒、紅椒、黃椒和芝士，放進焗爐以200度焗至Pizza餅底全熟，即可取出上碟。" },
    				{ "菜名:\t麵包布甸", "材料:\t鮮奶、牛油、忌廉、雞蛋、乾果、麵包", "做法:\t1.麵包撕成細片，放進膠袋內，加入砂糖和肉桂粉，搖勻。", "2.焗盤底放上乾果，再放上麵包，抹上預熱變溶的牛油。", "3.雞蛋、牛奶、忌廉和砂糖拌勻，倒進焗盤內，待麵包吸收了部份牛奶後，放進180度焗爐內焗至麵包略變焦黃便可。" },
    				{ "菜名:\t香蕉紅棗士多啤梨特飲", "材料:\t士多啤梨、香蕉、紅棗、橙汁", "做法:\t1.士多啤梨、香蕉、紅棗和橙汁以攪拌器打成飲品。", "2.倒進杯內放上點綴便可飲用。" },
    				{ "菜名:\t肉碎泡飯", "材料:\t肉餅、雞翼骨、冷飯、茴香、芹菜", "做法:\t1.起油鍋，下雞翼骨、薑絲和乾蔥片略炒，下清水、茴香和芹菜，以大火煮成湯汁。", "2.取出雞骨，下肉餅、胡椒粉、魚露和紹興酒略煮，下冷飯，略煮後下麻油便可上碟。" },
    				{ "菜名:\t咖喱牛肋骨條", "菜系:\t日本菜", "材料:\t牛肋骨、紅菜頭、日式咖喱、汽水、法包", "做法:\t1.起油鍋，下牛肋骨煎至每邊金黃色。", "2.下咖喱磚煮溶，下汽水略煮。", "3.紅菜頭切件，下鍋煮約25分鐘。", "4.上碟前下芫荽碎便可。", "5.法包放進焗爐內焗至香脆伴於碟旁。" }
            };
                imageid = new int[]{R.drawable.image015_1, R.drawable.image015_2, R.drawable.image015_3, R.drawable.image015_4,
    					R.drawable.image015_5};
            break;
                    
            case 15:
                recipes = new String[][]{		
    				{ "菜名:\t牛肋骨蘿蔔湯", "菜系:\t韓國菜", "材料:\t牛骨、牛仔骨、紅蘿蔔、京蔥、奇異果", "做法:\t1.牛仔骨以奇異果略醃，切件。", "2.牛骨加水以高速煲預先煮成湯汁。", "3.燒熱砂鍋，下乾蔥和薑片略炒，下牛仔骨煎香。", "4.下老抽、生抽、黃糖、少許牛骨湯和蠔油。", "5.牛仔骨煮至7、8成熟後取出，下牛骨、牛骨湯和紅蘿蔔略煮。", "6.把牛仔骨回鍋，下京蔥略煮便可上碟。" },
    				{ "菜名:\t韓式泡菜", "菜系:\t韓國菜", "材料:\t韓式辣椒粉、韓式辣椒醬、旺菜、韭菜", "做法:\t1.旺菜、蔥和韭菜下鹽醃約1小時，除去菜的水份，把菜切段，備用。", "2.旺菜、蔥和韭菜下蒜蓉、乾蔥、辣椒粉、辣椒醬、魚露和糖拌勻，略醃便可。" },
    				{ "菜名:\t韓式泡菜腩片炒年糕", "菜系:\t韓國菜", "材料:\t韓式年糕、豬腩肉、京蔥、泡菜", "做法:\t1.起油鍋，下豬腩肉略炒，下京蔥、泡菜、年糕、辣椒和清水。", "2.加蓋煮略煮，下麻油炒勻，調味便可上碟。" },
    				{ "菜名:\t寸金白菜", "菜系:\t廣東菜/粵菜", "材料:\t旺菜、燒腩肉、銀杏、金華火腿粒、甘筍條、小棠菜、雞湯", "做法:\t1.旺菜撕成一片片。", "2.起白鍋，下鹽和水煮滾，下旺菜灼熟，盛起隔水放涼。", "3.旺菜上放上燒肉，卷成卷狀，再以紅蘿蔔絲打結，並以剪刀把菜卷外形收剪至美觀。", "4.把菜卷放於碟上，放到蒸爐內煎4分鐘。", "5.小棠菜除去葉，製成蓮花狀，備用。", "6.起白鍋，下水、銀杏和小棠菜略煮，盛起隔水備用。", "7.取出菜卷放於碟上，以銀杏和小棠菜伴碟。", "8.起白鍋，下雞湯、蠔油和生粉水煮成芡汁，淋於菜卷上，最後撒下金華火腿粒作點綴。" }
            };
                imageid = new int[]{R.drawable.image016_1, R.drawable.image016_2, R.drawable.image016_3, R.drawable.image016_4};
            break;
                    
            case 16:
                recipes = new String[][]{		
    				{ "菜名:\t咖喱馬鈴薯", "材料:\t馬鈴薯、紅豆角、番茄、豆腐乾、咖喱粉、黃薑粉、辣椒粉", "做法:\t1.馬鈴薯切粒，備用。", "2.起油鍋，下馬鈴薯略煎，下蒜蓉、洋蔥、番茄、咖喱粉、黃薑粉和辣椒粉炒勻。", "3.紅豆角和豆腐切粒下鍋炒勻，下香菇粉和清水，加蓋略煮至收汁，下辣椒絲和蔥絲炒勻便可上碟。" },
    				{ "菜名:\t鴛鴦薯絲餅", "材料:\t馬鈴薯、免治牛肉、芝士、雞蛋、韭黃、麵粉", "做法:\t1.馬鈴薯刨成絲，除去水份。", "2.下雞蛋、麵粉、鹽、黑胡椒和芝士拌勻，備用。", "3.取出部份馬鈴薯絲，下韭黃跟以生抽和生粉略醃的免治牛肉，拌勻，備用。", "4.起油鍋，把馬鈴薯絲下鍋煎至金黃色便可上碟，再放上青瓜和車厘茄伴碟。" },
    				{ "菜名:\t川式土豆絲", "菜系:\t四川菜", "材料:\t馬鈴薯、花椒、八角、指天椒、鎮江醋、麻油", "做法:\t1.馬鈴薯刨成絲，放進冷水中。", "2.烹調前把馬鈴薯絲取出，隔去水份。", "3.起油鍋，下花椒和八角略炒，下馬鈴薯絲、指天椒絲、鎮江醋和麻油炒勻便可上碟。", "4.最後放上指天椒絲和芫荽作點綴。" },
    				{ "菜名:\t香滑薯蓉", "材料:\t馬鈴薯、芝士、鮮奶、忌廉、牛油", "做法:\t1.馬鈴薯烚熟，放涼，壓成薯蓉。", "2.把鮮奶和牛油煮熱。", "3.薯蓉下鹽、胡椒粉、忌廉、鮮奶和牛油拌勻。", "4.把薯蓉放進焗盤中，放上芝士，放進焗爐內以200度焗至芝士變得焦香便可。" },
    				{ "菜名:\t鯧魚兩吃", "材料:\t金鯧、涼瓜、果皮、豆鼓、蒜蓉、上湯、紅椒、黃椒", "做法:\t1.涼瓜切件，除去白色部份，備用。", "2.鯧魚起肉，把魚肉切片，以鹽、酒和生粉略醃，下上湯中灼熟，備用。", "3.把魚骨清洗乾淨，抹乾水份。", "4.以針固定魚骨，沾上麵粉。", "5.起油鍋，下魚骨炸約25分鐘。", "6.取出魚骨，隔油，上碟，並放上伴碟作點綴。", "7.起油鍋，下蒜蓉、豆鼓和果皮略炒，下涼瓜、上湯、紅椒和黃椒炒勻，下生抽和蠔油作調味。", "8.下魚片、生粉水和油炒勻便可上碟，放於魚骨上，便可享用。" }
            };
                imageid = new int[]{R.drawable.image017_1, R.drawable.image017_2, R.drawable.image017_3, R.drawable.image017_4,
    					R.drawable.image017_5};
            break;
                    
            case 17:
               recipes = new String[][]{		
    				{ "菜名:\t紅衫魚木瓜湯", "材料:\t紅衫魚、木瓜、薑片", "做法:\t1.紅衫魚清洗後，以鹽略醃，備用。", "2.起油鍋，下薑片和紅衫魚略煎，放進魚袋內。", "3.電子煲中下水、木瓜和魚。", "4.煮至湯變成奶白色後便可倒進碗內飲用。" },
    				{ "菜名:\t黃鱔飯", "材料:\t黃鱔、米、薑汁", "做法:\t1.黃鱔下酒、薑汁、生抽、鹽和糖略醃，備用。", "2.砂鍋下水和米煮。", "3.米煮至收水後下黃鱔，煮至全熟便可。", "4.起白鍋，下生抽、糖、水和油略煮成醬汁，淋於黃鱔上，最後放上蔥花和芫荽作點綴。" },
    				{ "菜名:\t蒜片炒牛肝", "材料:\t牛肝、蒜頭、小棠菜", "做法:\t1.牛肝下酒、薑汁、老抽、生抽、生粉和糖略醃，備用。", "2.起油鍋，下蒜片炒至金黃後盛起，下蒜蓉、牛肝和蠔油快炒。", "3.把蒜片回鍋，炒勻便可上碟，再放上小棠菜伴碟。" },
    				{ "菜名:\t益母草蛋茶", "材料:\t益母草、雞蛋、片糖", "做法:\t1.水下雞蛋、益母草和片糖煮。", "2.煮至雞蛋全熟和略收乾水份變可上碟。", "主治功效:\t益母草有活血去瘀的功效，有助婦女產後調理身子。注意：『服用前，請詢問醫生』。" },
    				{ "菜名:\t蠔仔京蔥千層麵", "材料:\t蠔仔、千層麵、芝士、京蔥、雞湯、忌廉、白酒、雞蛋", "做法:\t1.蠔仔以鹽、生粉和水清理乾淨，放進水中備用。", "2.起油鍋，下薑片、蠔仔和蠔水以大火略煮。", "3.下白酒，煮至略熟後關火，備用。", "4.起油鍋，下京蔥略炒，下生粉炒勻，下白酒、忌廉和蠔仔炒勻，關火。", "5.下雞蛋，拌勻成醬汁，盛起，備用。", "6.鍋中下少許醬汁、千層麵、芝士和雞湯，放進160至180度焗爐焗30至45分鐘，便可取出享用。" }
           };
               imageid = new int[]{R.drawable.image018_1, R.drawable.image018_2, R.drawable.image018_3, R.drawable.image018_4,
						R.drawable.image018_5};
           break;
                   
           case 18:
               recipes = new String[][]{		
    				{ "菜名:\t雜菇飯", "材料:\t米、茶樹菇、秀珍菇、鮮冬菇、鴻禧菇、雲南紅菇、雞湯", "做法:\t1.米加菇水和雞湯以砂鍋略煮。", "2.起油鍋，下雜菇、香菇粉、糖、盆鹽和紹興酒略炒。", "3.把雜菇放到米上，下紅菇和紅菇水，煮至米全熟變成飯，便可食用。" },
    				{ "菜名:\t雜菌湯", "材料:\t蘑菇、鴻禧菇、金菇、雲南紅菇、牛油、橄欖油、雞湯、煙肉", "做法:\t1.所有菇浸水，瀝乾，菇水備用。", "2.起油鍋，下煙肉、紅菇、蘑菇、金菇、紹興酒、盆鹽、胡椒粉、牛油、蒜蓉和乾蔥碎炒勻。", "3.把所有材料放進攪拌器中，下菇水攪成湯。", "4.把湯回鍋，下牛油煮勻便可上碟，最後下少許橄欖油作點綴。" },
    				{ "菜名:\t素脆鱔", "材料:\t冬菇、陳醋、露筍、白芝麻", "做法:\t1.把冬菇以剪刀剪成長條狀，下生粉、麵粉、鹽和胡椒粉拌勻，備用。", "2.起油鍋，把冬菇炸至香脆，盛起隔油，備用。", "3.陳醋、糖、生抽、老抽和蠔油拌勻成醬汁。", "4.起油鍋，下薑絲、冬菇和醬汁快炒便可上碟，以露筍伴碟，最後撒下白芝麻作點綴。" },
    				{ "菜名:\t香煎雞髀菇扒", "材料:\t雞髀菇、金菇、蠔油、露筍", "做法:\t1.雞髀菇切件，走油。", "2.起白鍋，下雞髀菇略煎。", "3.另起白鍋，下蠔油、生抽、老抽、紹興酒和糖略煮成醬汁。", "4.雞髀菇煎至金黃後下醬汁、蔥和金菇炒勻便可上碟。" },
    				{ "菜名:\t三絲魚卷配翡翠蛋白加薺菜鴛鴦羹", "材料:\t鯇魚、金華火腿、冬筍、冬菇、韭菜、菠菜、薺菜、蛋白", "做法:\t1.鯇魚去骨和皮成魚片，備用。", "2.起油鍋，下薑片、魚骨和水煮成魚湯，隔去魚骨，備用。", "3.魚片下鹽、糖和胡椒粉略醃，備用。", "4.把金華火腿、冬菇和冬筍切成一同大小的長條狀。", "5.以魚片包著金華火腿、冬菇和冬筍卷成卷狀，以蔥在魚卷外打結，備用，把剩下的金華火腿、冬菇和冬筍切成蓉，備用。", "6.把菠菜和薺菜汆水，再浸到冰水中，盛起瀝乾，把菠菜切成碎放於碟中。", "7.把蛋白、魚湯、鹽、糖和胡椒粉拌勻，倒進碟中和菠菜拌勻。", "8.把蛋白放進鍋內蒸熟，放上魚片卷蒸3分鐘。", "9.另起白鍋，下魚湯、糖、鹽和生粉水煮成芡汁，淋於魚片卷上，再撒金華火腿上蓉。", "10.把薺菜和魚肉切碎，備用。", "11.另起白鍋，下魚湯、金華火腿、冬菇、冬筍、魚肉、糖、胡椒粉和鹽不停攪拌，煮至略收汁便可把一半羹倒進碗內。", "12.把剩下的羹加入薺菜煮勻，便可倒進碗內形成太極形狀。" }
           };
               imageid = new int[]{R.drawable.image019_1, R.drawable.image019_2, R.drawable.image019_3, R.drawable.image019_4,
						R.drawable.image019_5};
           break;
                   
           case 19:
               recipes = new String[][]{
    				{ "菜名:\t冬瓜鹹蛋肉片湯", "材料:\t冬瓜、鹹蛋、瘦肉、夜香花", "做法:\t1.水煮滾後下鹹蛋黃、冬瓜和冬菇粉略煮，下薑絲再煮。", "2.瘦肉以鹽和生粉略醃，備用。", "3.冬瓜煮至全熟後調味，下瘦肉。", "4.瘦肉煮至全熟後關火，下鹹蛋白和夜香花拌勻，盛起便可飲用。" },
    				{ "菜名:\t冬瓜炒魚肉", "材料:\t冬瓜、鯪魚肉、青椒、紅椒、黃椒", "做法:\t1.鯪魚肉下鹽、胡椒粉和生粉拌勻，備用。", "2.起油鍋，下鯪魚肉煎成餅狀，待煎至金黃色，盛起。", "3.鯪魚餅切件，備用。", "4.起油鍋，下薑絲略炒，下冬瓜、青椒、紅椒、黃椒鹽和胡椒粉略炒，下麻油、鯪魚餅、魚露和紹興酒炒勻，便可上碟。" },
    				{ "菜名:\t荷香冬瓜片蒸素卷", "材料:\t冬瓜、青瓜、紅蘿蔔、鮮冬菇", "做法:\t1.冬瓜切薄片，放上青瓜絲、紅蘿蔔絲和冬菇絲，下椒鹽，捲成卷狀，備用。", "2.蒸籠以荷葉鋪墊，放上冬瓜卷。", "3.把蒸籠放到鍋內蒸熟，取出。", "4.把水、鹽、冬菇粉、胡椒粉和生粉拌勻，下鍋煮至收汁，淋於冬瓜卷上，便可食用。" },
    				{ "菜名:\t雙瓜糖水", "材料:\t冬瓜皮、冬瓜瓤、西瓜皮、片糖", "做法:\t1.水煮滾後下西瓜皮、冬瓜皮、冬瓜瓤和片糖煮15分鐘。", "2.盛起，隔去所有材料便可飲用。" },
    				{ "菜名:\t香酥西樵大餅", "菜系:\t廣東菜/粵菜", "材料:\t五花腩、自發粉、雞蛋、花生、蔥", "做法:\t1.自發粉加清水拌勻，下鹽和油拌勻成粉漿。", "2.起油鍋，下五花腩略炒，下酒炒勻，盛起備用。", "3.粉漿下雞蛋、花生、蔥和豬肉拌勻，起油鍋，下鍋炸至金黃色，便可上碟，最後撒下蔥花作點綴。" } 
          };
               imageid = new int[]{R.drawable.image020_1, R.drawable.image020_2, R.drawable.image020_3, R.drawable.image020_4,
						R.drawable.image020_5};
          break;
                   
         case 20:
               recipes = new String[][]{		
    				//Epidso 21
    				{"菜名:	芋頭蝦米臘味大煲飯",
    							"材料:	油鴨髀、臘腸、膶腸、芋頭、蝦米、冬菇、米",
    							"做法:	1. 先將米洗好後倒入煲仔，用冬菇水煲飯。",
    							"2. 用臘鴨皮起鍋，爆香蝦米，放入冬菇粒及芋頭略炒後，加入切好的油鴨脾、臘腸及膶腸略炒。",
    							"3. 待煲仔飯中的水煮乾後，將所有炒好的材料倒進飯中，煮熟後便成。"},
    				{"菜名:	肥媽食平D辣雞煲",
    							"材料:	冰鮮雞、麻辣醬、柱侯醬、麵豉醬、豆瓣醬、紅尖椒、花椒、八角、蒽",
    							"做法:	1. 先用蝦米水、麻辣醬、豆瓣及柱侯醬醃好雞肉。",
    							"2. 在煲仔上起油鍋，爆香乾蒽頭、花椒、八角及紅尖椒，然後放入醃好的雞肉。",
    							"3. 然後加上蒽頭、老抽、生抽及麻油，待雞肉完全熟透便可上碟。"},
    				{"菜名:	魚頭煲",
    							"材料:	大魚頭、薑、蒽",
    							"做法:	1. 先將魚頭用胡椒粉、鹽及粟粉拌勻，然後用油半煎炸魚頭。",
    							"2. 待魚頭半熟，將煎魚的油倒入煲仔中，然後來爆香乾蒽頭、蒽頭、薑及蒜頭。",
    							"3. 把魚頭倒入煲仔中，加入魚露、酒及少許糖，燜一下即可。"},
    				{"菜名:	田雞煲",
    							"材料:	田雞、薑、蒽、蠔油",
    							"做法:	1. 田雞處理好後，先用廚酒、薑汁、數片薑、老抽、生抽、胡椒粉及糖。",
    							"2. 把煲仔預熱，下油爆香薑、乾蒽頭及蒽頭，然後倒入醃好的田雞，蓋好燜一下。",
    							"3. 加入蠔油及老抽，拌勻後便可。"},
    				{"菜名:	蝦湯浸勝瓜",
    							"材料:	勝瓜、蝦乾、鹹蛋",
    							"做法:	1. 起油鍋，爆香蒜頭、蝦頭及蝦殻，待蝦味滲出後就可以加水，煮滾後可以加入蝦乾。",
    							"2. 蝦湯煮好後，把渣隔掉後回鍋，然後加入剩餘的蝦乾及削掉纖維後的絲瓜。",
    							"3. 煮滾後加入鹹蛋白做成蛋花，倒入碗後加入鹹蛋黃在上面便成。"},
    				{"菜名:	娘惹菠蘿蝦",
    							"材料:	急凍中蝦、菠蘿、檸檬葉、香茅、椰汁、蝦醬",
    							"做法:	1. 燒熱油鑊，爆香蒜頭，加入蝦醬及辣椒醬，炒香後加入水及半個菠蘿搾成的汁。",
    							"2. 然後加入香茅及捏碎後的檸檬葉，煮數分鐘待味道滲出。",
    							"3. 另起油鍋，可以把蝦肉略煎一下，大約五成熟左右便能盛起備用。",
    							"4. 醬汁出味後，便可加入椰汁、糖、鹽及剩餘半個菠蘿的肉。",
    							"5. 把剛才的蝦肉回鍋，煮至全熟後便可上碟。"}
           };
               imageid = new int[]{R.drawable.image021_1, R.drawable.image021_2, R.drawable.image021_3, R.drawable.image021_4,
						R.drawable.image021_5, R.drawable.image021_6};
           break;
                   
           case 21:
               recipes = new String[][]{						
    				//Epidso 22
    				{"菜名:	豬頸肉叉燒",
    							"材料:	豬頸肉、海鮮醬、叉燒醬、柱侯醬、玫瑰露、蜜糖",
    							"做法:	1. 先將豬頸肉扎針，然後加入海鮮醬、叉燒𨫥、柱侯醬及玫瑰露醃半個小時。",
    							"2. 然後放入光波爐／焗爐(＠220度)，焗至表面金黃色，塗上蜜糖，再燒至熟透便成。"},
    				{"菜名:	脆皮燒肉",
    							"材料:	豬腩肉、粗鹽",
    							"做法:	1. 先將豬腩肉扎針，用粗鹽搓它的豬皮，然後粗鹽醃，放少許水，豬皮向下，放進塑膠袋，待至少三個小時。",
    							"2. 醃好後，將豬腩沖洗表面的粗鹽，放入光波爐燒。先燒豬肉一面，待有點焦了之後，翻過來去燒豬皮的一面，直至豬皮香脆即可。"},
    				{"菜名:	秘制牛肋骨",
    							"材料:	牛肋條、迷迭香、百里香、檸檬、奇異果、雪梨、蜜糖",
    							"做法:	1. 先用奇異果汁及梨汁將牛肋條醃一會兒，然後放迷迭香、百里香、鹽、胡椒粉、黑胡椒粒、檸檬皮、檸檬汁、生抽、老抽及紹興酒",
    							"2. 然後放入焗爐以220度焗制，焗熟後掃上一層蜜糖，再焗幾十秒便可上碟。"},
    				{"菜名:	特色燒雞",
    							"材料:	冰鮮雞、馬鈴薯、迷迭香、百里香、檸檬",
    							"做法:	1. 先將凍鮮雞以迷迭香、鹽、黑胡椒粉、檸檬汁醃一會先。",
    							"2. 將薯仔、乾蒽頭、蒜頭、黑胡椒粉、檸檬汁、迷迭香及橄欖油放底，將醃好的雞放上面，然後放入焗爐以220度焗制，焗至熟透便成"},
    				{"菜名:	青瓜乳酪凍湯",
    							"菜系:	西班牙菜",
    							"材料:	青瓜、青尖椒、薄荷葉、洋蒽、原味乳酪",
    							"做法:	1. 先把青瓜和水放入攪拌機攪成漿，在攪動其間加入青椒、薄荷葉及洋蒽。",
    							"2. 再加入鹽、一茶匙蜜糖、兩湯匙檸檬汁和兩湯匙橄欖油，待拌勻後，便可加入乳酪再拌勻。",
    							"3. 倒入碗中，加上黑椒，然後放入雪櫃至冰凍便成"},
    				{"菜名:	西班牙海鮮飯",
    							"菜系:	西班牙菜",
    							"材料:	急凍大蝦、魷魚、青口、辣肉腸、煙肉、意大利米、紅／黃燈籠椒、番紅花、蕃茄、青豆、白酒、雞湯",
    							"做法:	1. 以橄欖油起鍋，炒香蒜蓉及洋蒽，加入煙肉及辣肉腸炒香。",
    							"2. 然後加入意大利米、紅椒粉、辣椒碎、白酒、黃椒及紅椒，拌勻後便可加雞湯，番紅花、蕃茄及大蝦，煮滾後轉小火。",
    							"3. 十分鐘後，便能加入魷魚、青口、青豆及橄欖油，再用慢火煮5分鐘便成"}
           };
               imageid = new int[]{R.drawable.image022_1, R.drawable.image022_2, R.drawable.image022_3, R.drawable.image022_4,
						R.drawable.image022_5, R.drawable.image022_6};
           break;
                   
           case 22:
               recipes = new String[][]{					
    				//Epidso 23
    				{"菜名:	煎雞肝配奇脆法包",
    							"材料:	雞肝、法包、白蘭地、檸檬、牛油、鮮奶、麵粉、羅勒葉、番荽",
    							"做法:	1. 先將雞肝用鹽、胡椒粉、白蘭地及少許生粉醃起。",
    							"2. 以牛油起鍋，爆香蒜粒及乾蒽頭，加入醃好的雞肝、番荽、羅勒葉及檸檬汁炒勻",
    							"3. 空出一半鍋，下牛油，把麵粉炒香，加一點鮮奶拌勻。",
    							"4. 最後將所有東西一齊炒勻，放上法包上食用即可。"},
    				{"菜名:	芒果龍脷卷",
    							"材料:	芒果、急凍龍脷柳、牛油",
    							"做法:	1. 先將半份芒果切條，用龍脷柳將芒果條捲起，以牙籤固定，將另外半份芒果放入攪拌機打汁備用。",
    							"2. 起鍋，加入橄欖油及牛油，將龍脷柳卷煎香。",
    							"3. 空出半個鍋，加入橄欖油及牛油，再加入芒果汁及上湯，最後與龍脷柳卷拌勻，上碟後拔掉牙籤便成"},
    				{"菜名:	鮮魷魚墨汁意大利麵",
    							"材料:	魷魚、墨汁麵、迷迭香、番荽、羅勒葉",
    							"做法:	1. 燒熱油鑊，爆香乾蒽頭，放入魷魚，加入紹興酒、胡椒、鹽及墨仔把魷魚炒至半熟，盛起備用。",
    							"2. 起油鑊，放下墨汁麵，加入鹽、胡椒粉、橄欖油及上湯炒至乾身。",
    							"3. 然後加入乾蒽、番荽、羅勒葉及魚露拌勻。",
    							"4. 最後加入剛入的炒好的魷魚炒勻，上碟即可。"},
    				{"菜名:	酥皮海鮮湯",
    							"材料:	紅鱲仔、魷魚鬚、酥皮、牛油、紅蘿蔔、麵粉",
    							"做法:	1. 起油鍋，爆香薑片，煎香紅鱲仔，然後放進魚袋裡用來熬湯。",
    							"2. 將魚袋放鍋裡，加入水用大火熬湯。",
    							"3. 起油鍋，加入牛油、橄欖油及麵粉，然後加入魚湯，煮滾後加入魷魚鬚便可以熄火，將湯倒入碗中。",
    							"4. 將酥皮覆蓋碗頂，塗上一層蛋漿，放入焗爐焗至酥皮冒起便成。"},
    				{"菜名:	囍愛嚐花",
    							"材料:	沙律菜、車喱茄、甘筍、唐芹、紅尖椒、白蘿蔔、唐生菜、普寧豆醬、芝麻醬、青芥辣",
    							"做法:	1. 將所有生果蔬菜在碟上舖設成各種不同花的形狀（擺設因個人喜愛而異）。",
    							"2. 然後調制醬汁，將普寧豆醬、芝麻醬、生抽、麻油及青芥辣混合便成。",
    							"3. 沙律配以醬汁食用即可。"}
           };
               imageid = new int[]{R.drawable.image023_1, R.drawable.image023_2, R.drawable.image023_3, R.drawable.image023_4,
						R.drawable.image023_5};
           break;
                   
           case 23:
               recipes = new String[][]{						
    				//Epidso 24
    				{"菜名:	鮮榨菜心菠蘿汁",
    							"材料:	菜心、菠蘿",
    							"做法:	將菜心、菠蘿及水放入攪拌機中，打成汁便成"},
    				{"菜名:	簡易菜飯",
    							"材料:	菜心、蝦乾、冬菇、米",
    							"做法:	1. 起油鍋，爆香浸好的蝦米，加入切碎的菜心及煮好的飯拌勻。",
    							"2. 將拌好的飯放入煲仔中，加入胡椒粉及鹽煮香，最後加入生抽及熟油拌勻便成。"},
    				{"菜名:	豆環藏蝦丸",
    							"材料:	蝦、豆角",
    							"做法:	1. 先取出蝦肉，加入鹽、胡椒粉、蒽、芫茜及生粉，打成蝦膠備用。",
    							"2. 用鹽、水及油將豆角煮軟，打結後做成一個座盤的形狀，然後將蝦膠搓成粒狀放上面，可以再加少少熟油在面。",
    							"3. 然後隔水蒸，蒸至熟透便成。"},
    				{"菜名:	蝦士湯浸冬瓜粒",
    							"材料:	蝦殻、冬瓜、菜心",
    							"做法:	1. 起油鑊，加入乾蒽頭及蝦頭蝦殻爆香，加少許酒，煎香後加入少許上湯煮滾。",
    							"2. 將少許蝦湯連同剩餘的菜心放入攪拌機中打爛，然後倒回其餘蝦湯的鍋中，並加入冬瓜粒，煮滾後便成。"},
    				{"菜名:	馬頭紅蘿蔔粥",
    							"材料:	馬頭魚、紅蘿蔔、米",
    							"做法:	1. 先將紅蘿蔔及米煮成紅蘿蔔粥備用。",
    							"2. 將用少許鹽醃好的馬頭魚加薑絲拿去隔水蒸，蒸熟後取出起肉。",
    							"3. 將魚肉倒進紅蘿蔔粥中拌勻煮一會兒，上碟即可。"},
    				{"菜名:	香煎馬頭",
    							"材料:	馬頭魚",
    							"做法:	起油鍋，將用少許鹽醃好的馬頭魚兩面煎香便成。"},
    				{"菜名:	鎮江雙艷",
    							"材料:	蓮藕、茄子、紅／黃燈籠椒、蜜糖豆、紅蘿蔔、馬蹄、鎮江醋、紹興酒",
    							"做法:	1. 將蓮藕切薄片，用水煮一下，取出後放冰水過冷河，待冷凍後取出放紙巾上吸水。",
    							"2. 用自發粉、水及油攪成糊狀做成脆漿，將蓮藕片放入脆漿，然後放入油鍋裡炸，炸兩三分鐘便成。",
    							"3. 調配醬汁，加入水、醋、酒、糖、生抽、薑米及生粉水，待糖融掉及煮滾後備用。",
    							"4. 茄子去皮，切成一吋半長，然後放入油鑊泡油，大約炸兩分半鐘，盛起吸油。",
    							"5. 將茄子放入醬汁中，煮滾後便關火浸泡，大約半分鐘便成。",
    							"6. 另外油鍋煮配料，加入馬蹄、甘筍及蜜豆片，灑少許清湯及鹽，炒一會兒便成。",
    							"7. 將茄子上碟，配料放茄子上面。另外炸脆蓮藕片可以灑上少許淮鹽。鎮江雙艷便成"}
    		};
               imageid = new int[]{R.drawable.image024_1, R.drawable.image024_2, R.drawable.image024_3, R.drawable.image024_4,
						R.drawable.image024_5, R.drawable.image024_6, R.drawable.image024_7};
            break;
            } //end switch
        } else {
            setTitle(R.string.imagebutton2);
            
switch(whichEpidso){
            
            case 0:
            recipes = new String[][]{ 
    				{"菜名:	薯仔紅蘿蔔番茄炆雞翼",
    							"材料:	雞翼(切件)、馬鈴薯、紅蘿蔔、番茄、薑",
    							"調味:	黃糖、紹興酒、麻油、水",
    							"做法:	1.燒熱油鑊，加入雞翼、薑片，再淋上少許紹酒煎香材料。",
    							"    	2.順序加入番茄、薯仔，以黃糖、鹽調味，稍煮後加水封蓋，以慢火炆熟。",
    							"    	3.最後揭開煲蓋用大火收汁即可。"},
    				{"菜名:	可樂雞翼",
    							"材料:	雞翼",
    							"調味:	可樂、生抽、老抽",
    							"做法:	1.燒熱油鑊，先下薑，與雞翼一同煎香。",
    							"		2.煎脆雞皮後，先加入可樂、生抽、老抽、少許冰糖以慢火煮滾，再用大火煮至水份收乾。",
    							"		3.最後夾起雞翼，重新煎香至醬汁稠身即可。"},
    				{"菜名:	瑞士雞翼",
    							"材料:	新鮮雞翼、桂皮、香葉、果皮",
    							"調味:	冰糖、老抽、生抽、甜豉油",
    							"做法:	1.燒熱油鑊，爆香薑片、桂皮、香葉，然後放入雞翼，再加冰糖、香葉拌勻調味，稍為煎熟。",
    							"		2.加入生抽、老抽，以及少量清水，以慢火炆熟，上碟前加入甜豉油調味即可。"},
    				{"菜名:	土匪雞翼",
    							"材料:	雞翼",
    							"調味:	孜然粉、孜然粒、黑芝麻",
    							"做法:	用孜然粉、香菇粉、鹽醃製雞翼片刻，之後灑上黑芝麻，用二百度火溫將雞翼燒熟即可。"},
    				{"菜名:	金針雲耳蒸雞翼",
    							"材料:	雞翼、金針(預先浸泡並綁成結狀)、雲耳",
    							"調味:	紹興酒、麻油、生抽、鹽、糖、豆粉、麻油",
    							"做法:	1.用酒、麻油、鹽、糖、豆粉、少許生抽將雞翼醃好，",
    							"		2.將金針、雲耳舖在雞翼上，再加入豆粉、豉油、鹽、麻油拌勻調味，蒸熟即可。"},
    				{"菜名:	叉燒雞翼",
    							"材料:	雞翼",
    							"調味:	柱侯醬、叉燒醬、玫瑰露、蜜糖",
    							"做法:	以一細匙柱侯醬、叉燒醬，以及少量玫瑰露拌勻雞翼調味，用二百度火溫將雞翼燒熟，臨近上碟前塗上蜜糖調味即可。"},
    				{"菜名:	墨魚滑釀雞翼",
    							"材料:	雞翼(去骨)、墨魚滑",
    							"調味:	生粉",
    							"做法:	1.去骨雞翼蘸上生粉，將墨魚滑釀入雞翼中。",
    							"		2.燒紅油溫後稍為調低火溫，將雞翼放入油中慢慢炸至金黃色即可。"},
    				{"菜名:	三色釀雞翼",
    							"材料:	雞中翼(去骨)、綠燈籠椒、紅燈籠椒、西芹、薑",
    							"做法:	1.將綠燈籠椒、紅燈籠椒、西芹切粒，釀入雞中翼內。",
    							"		2.燒熱油鑊爆薑，煎香雞翼，最後封蓋將雞翼焗熟即可。"},
    				{"菜名:	香檸蜜汁雞翼",
    							"材料:	雞翼",
    							"調味:	紅菇粉、鹽、生粉、檸檬汁、檸檬皮、蜜糖、豆粉、水",
    							"做法:	1.先以紅菇粉、鹽、生粉醃好雞翼，放入油鑊炸熟。",
    							"		2.混和檸檬汁、檸檬皮、蜜糖並煮熱，期間慢慢倒入豆粉水，令芡汁漸漸變稠，製成「香檸蜜汁」。",
    							"		3.最後將「香檸蜜汁」淋在油炸雞翼上即可。"},
    				{"菜名:	薯片雞翼",
    							"材料:	雞翼、薯片(壓碎)或粟米片、蛋白",
    							"做法:	1.以少許鹽及豉油醃好雞翼，然後加入蛋白拌勻。",
    							"		2.把雞翼蘸上薯片碎或粟米片，放落油鑊炸至金黃色即可。"},
    				{"菜名:	Tiramisu手造雪糕",
    							"材料:	淡忌廉300-400克、即溶咖啡粉、煉奶、雲呢拿油",
    							"做法:	將淡忌廉打至六成起泡，加入半罐左右的煉奶、少許雲呢拿油、兩匙咖啡粉後，充分拌勻，倒入容器後，放入冰箱雪兩、三小時至硬身即可。"}
            };
            imageid = new int[]{R.drawable.image1_1, R.drawable.image1_2, R.drawable.image1_3, R.drawable.image1_4,
    				R.drawable.image1_5, R.drawable.image1_6, R.drawable.image1_7, R.drawable.image1_8,
    				R.drawable.image1_9, R.drawable.image1_10, R.drawable.image1_11};
            break;
            
            case 1:
            recipes = new String[][]{ 
    				{"菜名:	日本醬油",
    							"菜系:	日本菜",
    							"材料:	味醂150毫升、清酒200毫升、豉油250毫升，水、老抽兩茶匙、適量的蔥條、薑片、蒜頭，冰糖",
    							"做法:	將味醂、清酒、豉油、水、老抽、蔥、薑、蒜頭、冰糖混和，一同煮二十分鐘即可。"},
    				{"菜名:	日式叉燒",
    							"菜系:	日本菜",
    							"材料:	豬腩肉 (五花腩)、蔥條、薑片、蒜頭",
    							"調味:	日式醬油",
    							"做法:	1. 先用鹽醃好五花腩，捲起五花腩用幼繩紮至圓筒型。",
    							"		2. 燒熱油鑊，爆香薑片、洋蔥，與五花腩一併煎香，然後加水，再放入蒜頭、蔥、薑炆半小時。",
    							"		3. 將炆好的叉燒用日本醬油稍炆片刻，再浸泡數小時調味。",
    							"實用資訊 :	用水炆五花腩時，可加入適量的生米，吸走油份。"},
    				{"菜名:	麻油燒骨湯底",
    							"菜系:	日本菜",
    							"材料:	燒豬骨、豬骨、雞腳三根、昆布、魚乾、木魚碎、洋蔥、蔥頭、紅蘿蔔、蘋果、黑麻油",
    							"做法:	先將燒豬骨出水，然後加水與雞腳、豬骨、昆布、鹹魚乾、木魚碎、洋蔥、蔥頭、紅蘿蔔、蘋果、黑麻油，用大火熬製。"},
    				{"菜名:	拉麵",
    							"材料:	高筋麵粉200克、鴨蛋兩隻",
    							"調味:	橄欖油、水、鹽半茶匙",
    							"做法:	將200克高筋粉與鹽攪勻，將80毫升的蛋漿加數滴橄欖油，倒入高筋粉團中，再搓成麵團，切成麵條。用滾水將麵條煮兩分鐘至適中硬度即可。"},
    				{"菜名:	日式豬骨湯叉燒拉麵",
    							"菜系:	日本菜",
    							"材料:	日式叉燒 (切片)、溏心溫泉蛋(半隻)、麻油燒骨湯底、拉麵、粟米粒、膠白筍(切幼段)、蔥段",
    							"調味:	黑麻油",
    							"做法:	先放拉麵底，加入麻油燒骨湯底，放上日式叉燒、粟米粒、膠白筍、蔥段、溫泉蛋，最後平均地倒入黑麻油調味即可。",
    							"實用資訊 :	在滾熟溫泉蛋的時候，如想令蛋黃保持原位，可以在煮蛋時攪動熱水，令蛋隻保持在漩渦的中心。"},
    				{"菜名:	芒果斑蘭班戟",
    							"材料:	雞蛋兩隻、高筋麵粉100克、鮮奶250克、砂糖1湯匙、幼鹽1/4茶匙、斑蘭精油4滴、煉奶、椰絲、芒果(切塊)",
    							"做法:	1. 先將高筋麵粉、砂糖、鹽、鮮奶、雞蛋攪勻，滴少許斑蘭精油拌勻，最後將雜質隔走。",
    							"		2. 燒熱平底鑊，抹上一層極薄的油，把適量的粉漿平均攤滿整個平底鑊，煎成餅皮，放涼待用。",
    							"		3. 將芒果放在餅皮上，把椰絲和煉奶混合，輕輕塗在芒果表面，最後把餅皮捲起即可。"}
            };
            imageid = new int[]{R.drawable.image2_1, R.drawable.image2_2, R.drawable.image2_3, R.drawable.image2_4,
    				R.drawable.image2_5, R.drawable.image2_6};
            break;
            
            case 2:
            recipes = new String[][]{  
    				{"菜名:	芝士撈即食麵",
    							"材料:	即食麵、芝士、牛油 (切塊狀)、麵粉、雞湯",
    							"做法:	1. 先將即食麵煮稔，撈起待用。",
    							"2. 將牛油放落熱鑊，加入少許油、一茶匙麵粉、芝士兩塊、適量的水或上湯，將芝士慢慢煮溶。",
    							"3. 將調味粉與即食麵撈勻，放落鑊與芝士汁一起拌勻，上碟即可。"},
    				{"菜名:	花生醬西多",
    							"材料:	方包、花生醬、鮮奶、雞蛋",
    							"做法:	1. 先將鮮奶與蛋漿打勻，備用。",
    							"2. 在麵包塗上花生醬，切邊，然後整塊蘸滿蛋漿，落鑊煎至金黃色，上碟隔油即可。",
    							"實用資訊 :	將剩餘的麵包皮切開，放落橄欖油鑊煎，可以變成另一款非常美味的小食。(詳見「香炸麵包條」)"},
    				{"菜名:	香炸麵包條",
    							"材料:	麵包皮、鮮奶、雞蛋",
    							"調味:	糖",
    							"做法:	將糖加入鮮奶蛋漿中，將麵包皮一分為二切開，蘸上蛋漿，放落油鑊炸至金黃色，上碟即可。"},
    				{"菜名:	超滑蛋治",
    							"材料:	方包、雞蛋、鮮奶",
    							"調味:	生粉芡",
    							"做法:	1. 將奶及生粉芡加入蛋漿，一併打勻。",
    							"2. 加熱油鑊，加入蛋漿後熄火，利用鑊的餘溫將蛋快速炒熟，再將炒蛋夾在麵包中間即可。",
    							"實用資訊 :	炒滑蛋秘訣，在於攪蛋時盡量將空氣打入蛋漿；又或者加奶令蛋質變滑，並加入豆粉令炒蛋維持濕潤狀態。"},
    				{"菜名:	沙爹牛肉",
    							"材料:	牛冧肉、乾蔥頭",
    							"調味:	黃薑粉、花生醬、咖喱粉",
    							"做法:	1. 用油、糖、豉油醃好牛肉，燒熱油鑊，將牛肉炒至半熟，盛起備用。",
    							"2. 用微火爆香乾蔥頭，加入黃薑粉、咖喱粉、花生醬煮熱拌勻，熄火後加入半熟的牛肉一併炒勻，上碟即可。",
    							"實用資訊 :	醃牛肉時適宜先落油，令肉質變得鬆軟，然後才加入其他調味料醃。"},
    				{"菜名:	芒果腸粉",
    							"材料:	芒果、粘米粉16克、木薯粉100克、椰漿、芝麻",
    							"調味:	砂糖",
    							"做法:	1. 倒入少許熱水把砂糖攪溶，加入椰漿、芒果汁，再慢慢倒入粘米粉加木薯粉拌勻，然後隔走雜質。",
    							"2. 在鐵盤上舖上保鮮紙，將粉漿平均地倒滿鐵盤，落鑊蒸三分鐘，拿起放涼。",
    							"3. 在粉皮上放上芒果，捲成條狀，淋上椰漿，灑少許芝麻粒，最後以芒果粒伴碟即可。"}
            };
            imageid = new int[]{R.drawable.image3_1, R.drawable.image3_2, R.drawable.image3_3, R.drawable.image3_4,
    				R.drawable.image3_5, R.drawable.image3_6};
            break;
            
            case 3:
            recipes = new String[][]{  
    				{"菜名:	蒜茸豆豉蒸花鮫仔",
    							"材料:	花鮫仔、蒜茸、豆豉、辣椒",
    							"做法:	將蒜頭、豆豉加糖搗爛成蓉，舖在花鮫仔上面，用滾水蒸四至五分鐘，上碟即可。"},
    				{"菜名:	鹽燒鱸魚",
    							"材料:	鱸魚",
    							"調味:	海鹽",
    							"做法:	在魚身割出幾道深痕，將海鹽平均抹在魚身。用錫紙包住魚身，放入光波爐用二百度高溫焗八至十分鐘(期間翻轉魚身)，焗完後見魚皮呈脆身時，上碟即可。"},
    				{"菜名:	煎封黃魚配泰式青檸汁",
    							"材料:	黃魚、青檸、金不換(切碎)、辣椒",
    							"調味:	生粉、糖、魚露",
    							"做法:	1. 在黃魚身上抹上少許生粉；燒熱油鑊，放下黃魚煎熟至金黃色，上碟備用。",
    							"2. 將魚露、金不換、糖拌勻，加入辣椒、青檸汁製成泰式青檸汁即可。"},
    				{"菜名:	番茄煮紅衫魚",
    							"材料:	紅衫魚、番茄(切件)、茄汁、蔥頭",
    							"做法:	1. 燒熱油鑊，放下紅衫魚煎熟至金黃色，備用。",
    							"2. 燒熱油鑊，加入番茄，並以糖、鹽調味。落少許蔥頭，茄汁加水拌勻並倒落鑊調味，然後收乾番茄汁。",
    							"3. 將番茄汁淋在魚身上，上碟即可。"},
    				{"菜名:	朱古力慕絲",
    							"材料:	黑朱古力200克、鮮奶45克、忌廉435克(打至六成起泡)、冧酒24克、魚膠片5克",
    							"做法:	1. 將黑朱古力、鮮奶、冧酒倒在碗中，隔水煮溶，期間放下魚膠片，直至所有材料煮溶後熄火。",
    							"2. 將碗放在冰上急凍，然後將朱古力與忌廉混和，從下而上打勻，將朱古力醬倒在杯中，放在雪櫃凝固後即可食用。"}
            };
            imageid = new int[]{R.drawable.image4_1, R.drawable.image4_2, R.drawable.image4_3, R.drawable.image4_4,
    				R.drawable.image4_5};
            break;
            
            case 4:
            recipes = new String[][]{
    				{"菜名:	咖啡骨",
    							"材料:	腩排",
    							"調味:	胡椒、即溶咖啡粉、上湯、紹興酒、豉油、豆粉",
    							"做法:	1. 先用胡椒、咖啡粉、紹興酒、豉油、豆粉醃好腩排。",
    							"2. 燒熱油鑊，將腩排放落鑊煎香；將咖啡粉、上湯、糖、豆粉打成芡汁落鑊，再加水、加紹酒，然後封蓋以細火將腩排稍焗數分鐘，收乾汁料至稠身，上碟即可。"},
    				{"菜名:	大漠風沙骨",
    							"材料:	金沙骨、蛋白、炸蒜、油蔥酥",
    							"調味:	蠔油、生粉",
    							"做法:	1. 先落油令金沙骨肉質變得鬆軟，再落蠔油、糖、豉油醃好金沙骨。加入蛋白、生粉與金沙骨拌勻。",
    							"2. 將金沙骨落鑊炸至脆身，撈起放涼再翻炸。",
    							"3. 燒熱油鑊，加入炸蒜、油蔥酥、胡椒粉，然後放金沙骨下鑊兜炒，上碟後加上少許辣椒粒伴碟即可。"},
    				{"菜名:	多味骨",
    							"材料:	金沙骨、三色燈籠椒(切成塊狀)、洋蔥(切成塊狀)、青檸皮",
    							"調味:	菠蘿汁、魚露、青檸汁、魚露、糖、生粉、咖啡粉、上湯",
    							"做法:	1. 先落油令金沙骨肉質變得鬆軟，再以魚露、糖、生粉醃好金沙骨。",
    							"2. 燒熱油鑊，放下金沙骨，再加入菠蘿汁、魚露、青檸調味，封蓋炆數分鐘 (途中加糖調味)。",
    							"3. 將洋蔥、三色燈寵放落油鑊炸數分鐘，撈起走油；然後與金沙骨兜炒，埋芡後上碟即可。"},
    				{"菜名:	超級生果盤",
    							"材料:	蜜瓜、西瓜、木瓜、火龍果、藍莓、奇異果、士多啤梨、青提",
    							"做法:	用竹簽戳起生果，然後……自由發揮，將竹簽生果插在果盤上，創出自我風格生果盤。"}
            };
            imageid = new int[]{R.drawable.image5_1, R.drawable.image5_2, R.drawable.image5_3, R.drawable.image5_4};
            break;
            
            case 5:
                recipes = new String[][]{
    				{"菜名:	韓式炒年糕",
    							"菜系:	韓國菜",
    							"材料:	年糕、泡菜、白蘿蔔(切絲)、紅蘿蔔(切絲)、韭菜、椰菜",
    							"調味:	韓式辣醬、韓式麵豉醬",
    							"做法:	1. 燒熱油鑊，放入泡菜、白蘿蔔絲、紅蘿蔔絲、年糕、椰菜，封蓋焗熟。",
    							"2. 材料煮熟後，加入面韓式面豉醬，韓式辣醬、糖調味，再放入韭菜拌勻，並以鹽、胡椒粉調味，上碟即可。"},
    				{"菜名:	韓式七彩冷麵",
    							"菜系:	韓國菜",
    							"材料:	蕎麥麵、醃製鮮人參(切絲)、雞蛋、青瓜(切絲)、甘筍(切絲)、椰菜(切絲)、木耳(切絲)、火腿(切絲)、芝麻",
    							"做法:	1. 將雞蛋與1茶匙的豆粉、少許的水打勻；燒熱油鑊，將蛋漿煎成蛋皮，切絲備用。",
    							"2. 把醃製人參、雞蛋絲、青瓜、甘筍、椰菜、木耳、火腿分門別類地圍在碟邊，在碟中間放下蕎麥麵，麵上放蛋絲、韓式辣醬，並灑上芝麻即可。"},
    				{"菜名:	泡菜燒豬腩肉",
    							"菜系:	韓國菜",
    							"材料:	豬腩肉、泡菜、生菜、蒜片",
    							"調味:	麻油、韓式辣醬、韓式麵豉醬",
    							"做法:	1. 先將麻油、泡菜加入攪拌機攪碎，然後用泡菜蓉醃豬腩肉。",
    							"2. 燒熱鑊，將豬肉直接放在鑊中燒熟，上碟備用。",
    							"3. 用生菜包住豬腩肉、蒜片、泡菜，加少許韓式辣醬、韓式麵豉醬，摺起生菜進食即可。"},
    				{"菜名:	火焰雪山",
    							"材料:	紙包蛋糕三件、雪糕、蛋白",
    							"調味:	砂糖、橙酒",
    							"做法:	1. 雪硬纸包蛋糕，方便切開。將兩件紙包蛋糕各自切開兩半後，圍放於碗邊向下壓實，並預留碗中心的空間放入其他材料。",
    							"2. 將雪糕盒割開，把雪糕整件拿起，放置在碗中心的空位上，並將蛋糕推向碗中心，壓實雪糕。",
    							"3. 將第三件紙包蛋糕切成四件，圍成方形作甜品的底層；把碗倒轉，金字塔式地將雪糕蛋糕放置在底層蛋糕上。",
    							"4. 將蛋白加三匙糖打成泡狀，塗滿蛋糕的外層，用火槍稍微燒焦蛋白。",
    							"5. 用火點燃橙酒，然後淋在蛋糕頂部，隨意加入生果或朱古力醬調味即可。"}
                };
                imageid = new int[]{R.drawable.image6_1, R.drawable.image6_2, R.drawable.image6_3, R.drawable.image6_4};
                break;
                
            case 6:
            	recipes = new String[][]{		
    				{"菜名:	泰式斑蘭雞",
    							"菜系:	泰國菜",
    							"材料:	冰鮮雞(斬件)、斑蘭葉 (用濕布抹乾淨)",
    							"調味:	麻油、蠔油、紹興酒、糖",
    							"做法:	1. 先用蠔油、麻油、紹興酒、糖醃好雞件，然後用斑蘭葉包裹雞件，以牙簽戳實。",
    							"2. 用二百度的油溫炸熟雞件，上碟即可。"},
    				{"菜名:	泰式蝦餅",
    							"菜系:	泰國菜",
    							"材料:	蝦肉(剁碎)、芫荽、蛋白、蔥白 (切碎)",
    							"調味:	紅咖喱醬、胡椒粉",
    							"做法:	1. 將芫荽頭、蔥白、胡椒粉、紅咖喱醬與蝦肉拌勻，然後將蝦肉打至起膠。",
    							"2. 把蝦肉搓成圓餅狀；燒熱油鑊，放入蝦餅，將兩邊煎至金黃色，撈起上碟即可。"},
    				{"菜名:	泰式魚餅",
    							"菜系:	泰國菜",
    							"材料:	鮫魚、檸檬葉、紅咖喱醬、豆角(切粒)、蛋白",
    							"調味:	豆粉",
    							"做法:	1. 將檸檬葉、蛋白、豆粉與鮫魚肉混和，將魚肉打至起膠，再放入青豆角拌勻。",
    							"2. 把魚肉搓成圓餅狀；燒熱油鑊，放入魚餅，將兩邊煎至金黃色，撈起上碟即可。"},
    				{"菜名:	椰皇燉蛋白",
    							"菜系:	泰國菜",
    							"材料:	椰皇殼、一份蛋白、一份鮮奶、一份半椰皇水",
    							"調味:	少許砂糖",
    							"做法:	1. 先將椰皇水暖熱，加入砂糖拌勻至溶化，盛起椰皇水備用。",
    							"2. 將椰皇水、鮮奶、蛋白輕輕拌勻，隔渣後倒在椰皇殼內，用保鮮紙封住椰殼，隔水蒸三十分鐘即可。"}
            };
            	imageid = new int[]{R.drawable.image7_1, R.drawable.image7_2, R.drawable.image7_3, R.drawable.image7_4};
            break;
                
            case 7:
                recipes = new String[][]{    				
    				{"菜名:	黃酒雞",
    							"菜系:	潮州菜",
    							"材料:	冰鮮雞 (切件)、黑麻油、紹興酒、木耳絲、薑 (切條)、雲耳",
    							"調味:	生抽、老抽、蠔油、豉油",
    							"做法:	1. 燒熱鑊身，加入黑麻油爆香薑條，加入雞件煎熟。",
    							"2. 加入紹酒、雲耳、木耳，並以鼓油、麻油調味，然後將所有材料搬至較大的鐵煲，封蓋焗熟。",
    							"3. 揭蓋後加入老抽調色，上碟即可。"},
    				{"菜名:	新式鹵肉飯",
    							"菜系:	潮州菜",
    							"材料:	豬頸肉、鴨蛋、木耳、飯、蔥頭、蒜粒",
    							"調味:	麻油、生油、麵豉醬、磨豉醬、老抽、蠔油、糖、紹興酒",
    							"做法:	1. 燒熱麻油及生油，爆香蔥頭、蒜粒，加入木耳，以麵豉醬、磨豉醬、蠔油、老抽、糖、紹興酒、水調味。",
    							"2. 加入豬頸肉，與配料拌勻，封蓋以慢火煲熟。",
    							"3. 揭蓋後，加入鴨蛋、蔥條拌勻，封蓋稍焗片刻，將材料加在白飯上即可。"},
    				{"菜名:	樹子A菜",
    							"菜系:	潮州菜",
    							"材料:	樹子、A菜 (油麥菜)",
    							"調味:	麻油",
    							"做法:	燒熱油鑊，加入A菜、樹子兜炒，上碟即可。"},
    				{"菜名:	紅棗杞子黑糖海燕窩果凍",
    							"菜系:	潮州菜",
    							"材料:	珊瑚草(剪碎)、紅棗、杞子、薑片",
    							"調味:	黑糖、水",
    							"做法:	1. 將珊瑚草、紅棗、薑片放入水中煮溶，加入黑糖攪溶，再放入杞子調味。",
    							"2. 將糖水及配料倒入杯中，放入雪櫃冷凍至糕狀即可。"}
            };
                imageid = new int[]{R.drawable.image8_1, R.drawable.image8_2, R.drawable.image8_3, R.drawable.image8_4};
            break;
                
            case 8:
                recipes = new String[][]{		
    				{"菜名:	葡燒乳豬全體",
    							"菜系:	葡國菜",
    							"材料:	乳豬、洋蔥 (切半)",
    							"調味:	鹽、黑胡椒、百里香、迷迭香、橄欖油、白蘭地",
    							"做法:	1. 用鹽、黑胡椒、百里香、迷迭香、橄欖油、白蘭地平均地塗在乳豬的全身。",
    							"2. 用鐵支穿起乳豬，撐開豬身，再用錫紙包住乳豬四肢。",
    							"3. 將乳豬以背部朝地的方式放入烤爐，先以二百五十度高溫燒二十五分鐘。",
    							"4. 拿出燒豬，取走鐵支，再反轉豬身，將洋蔥放在燒豬底部，用二百二十度溫度燒二十分鐘，上碟即可。",
    							"實用資訊 :	在豬腳的小腿部份輕割一刀，可減低豬皮烤熟後裂開的機會；另外，在洗好乳豬後，可以用風筒吹乾豬皮，令豬皮更易燒脆。"},
    				{"菜名:	葡國沙律",
    							"菜系:	葡國菜",
    							"材料:	番茄、唐生菜、洋蔥、黑水欖",
    							"調味:	橄欖油、黑胡椒、鹽",
    							"做法:	1. 將洋蔥切成薄片，把番茄切成厚片，再將唐生菜剝成一塊塊；",
    							"2. 將洋蔥、蕃茄、唐生菜及黑水欖放在一起，加入橄欖油、黑胡椒、鹽一併拌勻即可。"},
    				{"菜名:	非洲雞",
    							"菜系:	葡國菜",
    							"材料:	冰鮮雞、馬鈴薯、紅尖椒 (切條)、指天椒 (切粒)、椰絲、洋蔥 (切碎)、蒜蓉",
    							"調味:	花生醬、百里香、迷迭香、花奶、老抽、茄汁、黑胡椒、鹽、辣椒粉、白酒、上湯",
    							"做法:	1. 先用老抽、百里香、黑胡椒、鹽醃好鮮雞，將雞放入鑊中，燒香雞皮及雞身兩邊，備用。",
    							"2. 燒熱油鑊，爆香洋蔥粒、蒜蓉、紅尖椒、辣椒粉，加入白酒、迷迭香、百里香、上湯，拌勻煮熱。",
    							"3. 將燒雞與汁料一併煮熱，加入椰絲、花生醬、指天椒、茄汁、老抽，封蓋以慢火焗熟。",
    							"4. 揭蓋後，加入馬鈴薯，封蓋以慢火將馬鈴薯煮至腍身，最後揭蓋加入花奶，以慢火收汁，上碟即可。"},
    				{"菜名:	鴛鴦木糠蛋糕",
    							"材料:	瑪麗餅 (搗碎)、朱古力餅 (搗碎)、紅桑子、藍莓",
    							"調味:	鮮忌廉(用煉奶打起)",
    							"做法:	1. 將瑪麗餅碎加入杯中，然後舖上一層忌廉。",
    							"2. 將朱古力餅碎加入杯中，再舖上一層忌廉。",
    							"3. 重覆步驟1和2，將甜品杯盛滿為止，最後在頂部加入藍莓、紅燊子即可。"},
    		};
                imageid = new int[]{R.drawable.image9_1, R.drawable.image9_2, R.drawable.image9_3, R.drawable.image9_4};
            break;
                    
            case 9:
                recipes = new String[][]{    				
    				{"菜名:	海南雞飯",
    							"材料:	急凍雞髀、米、雞湯、斑蘭葉、香茅、薑、蔥",
    							"調味:	油1湯匙、蔥、鹽、胡椒",
    							"做法:	1. 先用鹽、胡椒醃好雞髀。",
    							"2. 將已洗好的米放入飯煲，加入上湯、油、蔥、香茅、斑蘭葉，蔥、薑，然後將雞髀放在米的上面。",
    							"3. 蓋上飯煲蓋，以正常的煮飯時間將材料蒸熟，即可。"},
    				{"菜名:	韓式海鮮豆腐鍋",
    							"菜系:	韓國菜",
    							"材料:	硬豆腐、急凍雜錦海鮮、韓國泡菜、紹菜",
    							"調味:	韓式麵豉醬、韓式辣醬、水、麻油、紹興酒",
    							"做法:	1. 用飯煲將水煲熟，加入韓式麵豉醬、韓式辣醬、麻油、紹興酒調味，放入豆腐、韓國泡菜、紹菜，蓋上飯煲蓋，將材料煮滾。",
    							"2. 煮滾材料後，揭開煲蓋，加入雜錦海鮮，再以麻油、紹酒調味，慢慢滾起即可。"},
    				{"菜名:	花生夾餅",
    							"材料:	麵粉、粘米粉、酵母、花生 (搗碎)、芝麻、雞蛋、椰絲 (搗碎)、梳打粉",
    							"調味:	水、鹽、雲呢拿油、砂糖",
    							"做法:	1. 先將酵母、梳打粉、雲呢拿油、糖、雞蛋加水拌勻，倒入麵粉、粘米粉、鹽攪勻至稠身，然後放入雪櫃放涼一小時備用。",
    							"2. 按份量將麵粉漿輕輕地倒入電飯煲中，旋轉煲身讓粉漿均勻地舖滿煲底，然後啟動電飯煲，蒸三至四分鐘製成餅底。",
    							"3. 炒香椰絲至金黃色，撈起與花生碎、糖、芝麻拌勻製成餡料。",
    							"4. 將牛油塗在餅底上，加入餡料，上碟即可。"},
    				{"菜名:	紫薯糖不甩",
    							"材料:	紫薯、糯米粉",
    							"調味:	水、椰絲、花生碎、芝麻、砂糖",
    							"做法:	1. 烚熟紫薯，搓爛後加入糯米粉拌勻，再慢慢加水，搓至粉團略見乾身。",
    							"2. 將紫薯粉團搓成圓形，放進熱水中，煮3-5分鐘。",
    							"3. 將湯圓放在花生碎上，灑上椰絲、芝麻、砂糖即可。"},
    				};
                imageid = new int[]{R.drawable.image10_1, R.drawable.image10_2, R.drawable.image10_3, R.drawable.image10_4};
            break;
                    
            case 10:
                recipes = new String[][]{		
    				{"菜名:	胡椒豬肚湯",
    							"材料:	豬肚、腐皮、鹹菜",
    							"調味:	水、白胡椒、白醋",
    							"做法:	1. 先加清水、酒、薑、蔥為豬肚汆水，然後把白胡椒放入豬肚之中，",
    							"2. 將腐皮、豬肚放入清水中煮滾，並加入半碎的白胡椒、鹹菜調味，再加入白醋減少油膩感",
    							"3. 封蓋用中火將材料煲滾即可。"},
    				{"菜名:	炆豬脷",
    							"材料:	豬脷、番茄(切件)、洋蔥 (切塊)、乾蔥、蒜片、薑片",
    							"調味:	老抽、生抽、麻油、蠔油、雞湯、黃糖、上湯、水",
    							"做法:	1. 以清水、酒、薑、蔥為豬脷汆水；燒熱油鑊，爆香洋蔥、蒜片及乾蔥頭，同時慢慢煎香豬脷。",
    							"2. 加入蕃茄、薑片兜炒，並以老抽、生抽、麻油、蠔油、黃糖、上湯、水調味，加大火力，炆腍食材即可。"},
    				{"菜名:	豬膶麵",
    							"材料:	豬膶、高筋麵粉、鴨蛋、小棠菜、薑",
    							"調味:	橄欖油、鹽、麻油、水、胡椒粉",
    							"做法:	1. 用鹽水浸好豬膶，再以梳打粉稍醃一下，即用清水洗淨豬膶，切片後以薑蓉、胡椒粉、鹽醃好豬膶，備用。",
    							"2. 將高筋麵粉倒入製麵機，啟動製麵機，慢慢倒入混合了麻油及鹽的鴨蛋漿，製成麵條。",
    							"3. 準備一鍋滾水，加入薑片、麻油，放入麵條煮兩分鐘，然後撈起麵條並用凍水沖洗，放入湯碗備用。",
    							"4. 將小棠菜放入滾水烚熟，撈起放入湯碗；放入豬膶稍煮一下，然後加入鹽、胡椒粉、麻油調味，連湯水將豬膶撈入湯碗即可。"},
    				{"菜名:	椰汁椰糖西米糕",
    							"材料:	西米",
    							"調味:	椰漿、椰糖 (切件)、鹽",
    							"做法:	1. 用熱水煮熟西米，期間不停攪動西米防止「黐底」，煮約十分鐘，直至西米粒中心還見白點，熄火封蓋焗十分鐘，撈起用凍水清洗。",
    							"2. 煮溶椰糖，盛起備用；煮熱椰漿，加入鹽調味，盛起備用。",
    							"3. 將椰奶和西米一併倒入容器，放入雪櫃冷卻；頭上尾下倒出西米糕，然後淋上椰糖即可。"},
    				};
                imageid = new int[]{R.drawable.image11_1, R.drawable.image11_2, R.drawable.image11_3, R.drawable.image11_4};
        				
            break;
                    
            case 11:
                recipes = new String[][]{		
    				{"菜名:	台灣牛肉麵",
    							"材料:	牛腱 (先用酒和水汆水)、洋蔥、蒜片、香蔥(切條)、薑片",
    							"調味:	豆瓣醬、老抽、生抽、紹興酒、麻油、蠔油、拉麵、上湯(或煲過牛骨的湯)、糖",
    							"做法:	1. 燒熱油鑊，爆香洋蔥頭、蒜片，放牛腱煎香，期間加入蔥條、薑片、豆瓣醬、老抽、生抽、上湯、紹酒、糖調味，封蓋用慢火炆煮片刻。",
    							"2. 將所有所料放入電煲中，用四十至四十五分鐘煲腍材料。"},
    				{"菜名:	西式炆牛脷",
    							"材料:	牛脷 (先加酒、薑、蔥汆水，並切走脷苔)、番茄(切件)、西芹(切件)、洋蔥(切片)、紅蘿蔔(切件)、桂皮、香葉、上湯(或煲過牛骨的湯)、蒜頭兩粒、蔥頭數片、薑片",
    							"調味:	紹興酒(或白酒)、老抽、蠔油",
    							"做法:	1. 燒熱油鑊，煎香牛脷，然後將牛脷放進已加入桂皮及香葉的上湯中同煮，並加入蒜頭、蔥頭、薑片、紹興酒調味。",
    							"2. 用油鑊爆香番茄、西芹、洋蔥、紅蘿蔔，然後加入大鍋與牛脷同煮。",
    							"3. 封蓋以大火滾十分鐘，再收細火炆四十五分鐘令牛脷變腍。",
    							"4. 將牛脷再次放落鑊煎香，淋滿牛脷汁料，加入老抽、蠔油調味，用大火收乾汁料，上碟切片即可。"},
    				{"菜名:	日式牛肉丼",
    							"材料:	肥牛肉、洋蔥(切片)、雞蛋、珍珠米",
    							"調味:	胡椒粉、清酒、味醂、日本醬油",
    							"做法:	1. 先用胡椒醃好肥牛；燒熱油鑊，爆香洋蔥，加入肥牛煎香，期間加入清酒、味醂、糖、日本醬油調味。",
    							"2. 打勻雞蛋，加入鑊中與所有材料拌勻，最後將材料放在珍珠米飯上，即可。"},
    				{"菜名:	雪蓮子雪棗糖水",
    							"材料:	雪蓮子(先浸發)、雪棗、桂圓、薑兩片",
    							"調味:	冰糖、水",
    							"做法:	預備滾水，依序放下雪棗、薑、雪蓮子、冰糖、桂圓，封蓋煲二十至三十分鐘即可。"},
    				};
                imageid = new int[]{R.drawable.image12_1, R.drawable.image12_2, R.drawable.image12_3, R.drawable.image12_4};
        				
            break;
                    
            case 12:
                recipes = new String[][]{		
    				{"菜名:	香橙鴨",
    							"材料:	米鴨、橙皮、橙汁、杏脯、洋蔥(切件)、紅尖椒、丁香、八角、桂皮、香葉",
    							"調味:	老抽、生抽、蠔油、紹興酒、鹽、冰糖",
    							"做法:	1. 洗淨並抹乾鴨身，用鹽醃好鴨的內部，用老抽替鴨身上色。",
    							"2. 燒熱油鑊，煎香鴨身，加入香葉、桂皮、八角、丁香、洋蔥後，加水、橙皮、橙汁、杏脯肉、冰糖、生抽、老抽調味，然後再加一隻尖椒，灒酒後封蓋大滾五至八分鐘，用細火炆腍香鴨。",
    							"3. 揭蓋用蠔油、豆粉水埋芡，上碟即可。"},
    				{"菜名:	冬菇炆鴨腳",
    							"材料:	炸鴨腳(先用薑和酒汆水)、冬菇(用豆粉及油醃好)、丁香、八角、香葉、乾元貝(用水浸發)兩粒",
    							"調味:	蠔油、老抽、生抽、麻油、冰糖",
    							"做法:	1. 煎香丁香、八角、香葉，加油煎香鴨腳，加入冬菇、乾元貝(連水)、清水，以蠔油、老抽、生抽、冰糖調味，封蓋用中火炆熟鴨腳。",
    							"2. 揭蓋用豆粉水埋芡，上碟即可。"},
    				{"菜名:	台式鴨舌",
    							"材料:	鴨舌(先用薑、酒和熱水汆水，再用油、鹽調醃)、丁香、八角、香葉、乾辣椒(切條)、紅尖椒(切圈)、蒜片、薑絲、蔥頭",
    							"調味:	豆瓣醬、老抽、蠔油、冰糖(拍碎)",
    							"做法:	1. 鴨舌先用薑、酒和熱水汆水，再用油、鹽調醃，備用。",
    							"2. 燒熱油鑊，煎香丁香、八角、香葉、乾辣椒，再加入蒜片、薑絲、蔥頭、紅尖椒、冰糖兜炒。",
    							"3. 加入鴨舌，以豆瓣醬、冰糖、滾水調味，用細火炆熟材料，最後用大火收汁，加入少許蠔油、辣椒粒調味，上碟即可。"},
    				{"菜名:	免焗疏乎厘",
    							"材料:	蛋白四隻、麵粉兩匙、蛋黃一隻、藍莓醬、藍莓粒",
    							"調味:	砂糖兩匙半、橄欖油、檸檬汁少許",
    							"做法:	1. 一邊打起蛋白，一邊加入砂糖、幾滴檸檬汁，將蛋白打至起泡。將麵粉、蛋黃、橄欖油加入蛋白拌勻。",
    							"2. 以少油的熱鑊煎香蛋黃漿，把蛋白放在蛋黃餅底上，用中火稍焗，直至蓋頂的冒出水蒸氣點，剷起餅底上碟。",
    							"3. 用火槍將蛋白略為燒焦，加上藍莓醬調味上色即可。"},
    				};
                imageid = new int[]{R.drawable.image13_1, R.drawable.image13_2, R.drawable.image13_3, R.drawable.image13_4};
            break;
                    
            case 13:
                recipes = new String[][]{		
    				{"菜名:	咖喱羊腩",
    							"菜系:	印度菜",
    							"材料:	羊腩、番茄(切碎粒)、馬鈴薯(切件)、指天椒(切粒)、紅尖椒(切條)、蒜頭、洋蔥粒、乾蔥粒、芫荽粒",
    							"調味:	印度雜錦香料、黃薑粉、咖喱粉、辣椒粉",
    							"做法:	1. 先用香葉、桂皮、蒜頭將羊腩炆腍；燒熱油鑊，爆香印度雜錦香料、洋蔥、乾蔥，然後加入蒜蓉、蕃茄粒。",
    							"2. 加入三份黃薑粉、二份咖喱粉、一份辣椒粉的份量為材料調味，收乾水後加鹽調味，並加入馬鈴薯、炆過羊腩的上湯(預先隔油)，一併煮熟。",
    							"3. 加入羊腩、炆過羊腩的上湯、指天椒、紅尖椒，封蓋大火炆煮片刻，再以細火炆熟材料，上碟前灑上芫荽粒即可。"},
    				{"菜名:	印度薄餅",
    							"菜系:	印度菜",
    							"材料:	酵母、麥粉、麵粉",
    							"調味:	橄欖油、鹽、糖、水、乳酪、蒜蓉、牛油",
    							"做法:	1. 先將酵母、糖與暖水混和；另外把麥粉、麵粉、乳酪、橄欖油、鹽混和，慢慢倒入酵母粉水拌勻，並搓至水份收乾。",
    							"2. 將薄餅壓扁成圓形，落鑊後一邊轉動薄餅一邊煎香，在餅面塗上蒜蓉牛油，上碟即可。"},
    				{"菜名:	鷹咀豆餅",
    							"菜系:	印度菜",
    							"材料:	鷹咀豆、橄欖油、麵包糠、蔥粒",
    							"調味:	鹽、胡椒粉、辣椒粉、咖喱粉",
    							"做法:	1. 將鷹咀豆、橄欖油、麵包糠、鹽、胡椒粉、辣椒粉、咖喱粉、蔥粒放入攪拌機，攪拌後，用手再將材料搓勻。",
    							"2. 將鷹咀豆粉團壓成餅狀，放落油鑊慢慢煎熟即可。"},
    				{"菜名:	栗子糊",
    							"材料:	栗子、鮮奶、米",
    							"調味:	冰糖、水、忌廉",
    							"做法:	先加水將冰糖煮溶；把粟子、米放入攪拌機，加入糖水、鮮奶，攪勻材料後倒入碗，淋上忌廉即可。"},
    				};
                imageid = new int[]{R.drawable.image14_1, R.drawable.image14_2, R.drawable.image14_3, R.drawable.image14_4};
            break;
                    
            case 14:
                recipes = new String[][]{		
    				{"菜名:	蔥爆羊肉",
    							"材料:	羊肉片、京蔥、洋蔥圈、薑條、蒜片",
    							"調味:	柱候醬、生抽、蠔油、芫荽籽、小茴、孜然、丁香、香葉、桂皮、辣椒、糖",
    							"做法:	1. 先用中火爆香芫荽籽、孜然、小茴、香葉、桂皮、丁香，再放入攪拌機攪勻，製成秘製香料粉備用。",
    							"2. 用油、秘製香料粉、柱候醬、辣椒、豉油、糖醃好羊肉。",
    							"3. 燒熱油鑊，爆香洋蔥、薑條、蒜片，慢慢加入羊肉片兜炒，最後加入京蔥一併炒勻，以豆粉、蠔油埋芡，上碟即可。"},
    				{"菜名:	羊肉飯",
    							"材料:	羊腿粒、印度米、蔥粒、辣椒粒、芫荽",
    							"調味:	糖、豉油、雞湯、芫荽籽、小茴、孜然、丁香、香葉、桂皮",
    							"做法:	1. 先用中火爆香芫荽籽、孜然、小茴、香葉、桂皮、丁香，再放入攪拌機攪勻，製成秘製香料粉備用。",
    							"2. 將羊肉汆水後，放薑、香葉、鹽將羊肉烚腍，用烚羊肉的剩下的水煮米，加入羊肉、秘製香料粉、桂皮、上湯，以細火煲熟米飯。",
    							"3. 將秘製香料粉加水煮香，再加入滾油、豉油、糖、蔥、芫荽、辣椒煮成甜豉油，淋上煲仔飯上即可。"},
    				{"菜名:	大盤雞",
    							"材料:	麻黃雞(切件)、番茄、馬鈴薯、紅蘿蔔、茄膏、香葉、桂皮、芫荽籽、小茴、孜然、草果、乾辣椒、八角、丁香、辣椒、洋蔥、薑片",
    							"調味:	鹽、糖",
    							"做法:	1. 先用中火爆香芫荽籽、孜然、小茴、香葉、桂皮、丁香，再放入攪拌機攪勻，製成秘製香料粉備用。",
    							"2. 先用鹽醃好麻黃雞；燒熱油鑊，爆香桂皮、香葉，再加入麻黃雞件爆熟。",
    							"3. 將煮麻黃雞件的剩油撈起燒熱，用來爆香薑片、蔥頭、乾辣椒、辣椒，加入茄膏、番茄炒勻，然後以芫荽籽、小茴、孜然、草果、八角、丁香調味。",
    							"4. 將配料倒落鑊與雞件一併兜炒，加水、鹽、糖調味，加入馬鈴薯、紅蘿蔔、辣椒，封蓋用細火炆，直至馬鈴薯煮至腍身，上碟即可。"},
    				{"菜名:	芒果布甸",
    							"材料:	芒果啫喱粉兩包、芒果粒隨意",
    							"調味:	暖水一杯半至兩杯、淡奶一杯",
    							"做法:	將啫喱粉加水攪勻，再加入淡奶與芒果粒拌勻，倒入容器，放入雪櫃冷卻至布甸凝固即可。"},
    				};
                imageid = new int[]{R.drawable.image15_1, R.drawable.image15_2, R.drawable.image15_3, R.drawable.image15_4};
            break;
                    
            case 15:
                recipes = new String[][]{		
    				{"菜名:	牛尾湯",
    							"材料:	牛尾 (用酒和薑汆水，切件)、紅蘿蔔(切件)、芹菜(切條)、馬鈴薯(切件)、洋蔥(切片)、水",
    							"做法:	先放紅蘿蔔、芹菜、馬鈴薯、洋蔥、牛尾，加水封蓋煲三十五至四十分鐘即可。"},
    				{"菜名:	黃耳木耳齋薑醋",
    							"材料:	甜醋、薑、黑豆、黃耳、木耳、雞蛋 (預先烚好)",
    							"調味:	鹽",
    							"做法:	燒熱油鑊，煎香薑塊，然後放落甜醋中，加入黑豆、黃耳、木耳、雞蛋，一併煲兩至三小時，期間加鹽調味即可。"},
    				{"菜名:	甜醋燴牛尾",
    							"材料:	牛尾",
    							"調味:	鹽、甜醋",
    							"做法:	燒熱油鑊，加入煲過「牛尾湯」的牛尾，煎香兩邊，淋上甜醋、鹽調味，上碟即可。"},
    				{"菜名:	陳醋炸蛋",
    							"材料:	雞蛋、薑(切絲)、蔥(切條)、辣椒粒",
    							"調味:	麻油、糖、香菇粉、陳醋、紹興酒",
    							"做法:	1. 燒熱油鑊，煎香薑絲、蔥條、辣椒粒，加入陳醋、糖、香菇粉、麻油、紹興酒調味，再灑少許薑條，製成醬料。",
    							"2. 將雞蛋放入油鑊炸至散開，然後撈起炸蛋放入醬料中同煮，灑上蔥花後上碟即可。"},
    				{"菜名:	楊枝甘露",
    							"材料:	芒果、金柚、西米、鮮奶、淡奶、椰奶、糖水",
    							"做法:	將芒果、糖水、鮮奶、淡奶、椰奶放入攪拌機中攪勻；將煮好的西米粒、金柚肉放在碗底，倒入芒果奶，再灑上少許金柚肉即可。"},
    				};
                imageid = new int[]{R.drawable.image16_1, R.drawable.image16_2, R.drawable.image16_3, R.drawable.image16_4, 
    				R.drawable.image16_5};
            break;
                    
            case 16:
                recipes = new String[][]{		
    				{"菜名:	素漢堡",
    							"材料:	豆腐、鷹咀豆、紅腰豆、燕麥片、檸檬皮、紅蘿蔔粒、西芹粒、雞蛋(可用黃芥末醬代替)、麵包皮(切粒)、麵包糠、生菜、蕃茄(切片)、洋蔥(切圈狀)",
    							"調味:	百里香(切碎)、迷迭香(切碎)、薄荷葉、芝士粉、芥末醬、蔥頭(切粒)",
    							"做法:	1. 將豆腐、鷹咀豆、紅腰豆、檸檬皮、紅蘿蔔、西芹、辣椒、西芹粒、蔥頭、雞蛋、迷迭香、百里香、薄荷葉、麵包皮、少量麵包糠放入攪拌機，並加鹽、胡椒粉、芝士粉調味，將材料攪勻製成素肉醬。",
    							"2. 拌勻黃芥末醬、麵包糠為素肉醬調味，再將素肉醬放入雪櫃冷卻。",
    							"3. 燒熱油鑊，將素肉醬搓成餅狀，以細火煎熟；在漢堡包皮上塗上牛油，放落鑊稍為煎香，在麵包中夾入生菜、番茄、洋蔥、素肉餅、芝士即可。"},
    				{"菜名:	墨西哥卷",
    							"材料:	墨西哥餅、鷹咀豆、紅腰豆、牛油果、粟米粒、生菜、番茄、芝士",
    							"調味:	橄欖油、黑胡椒、鹽",
    							"做法:	1. 將鷹咀豆、紅腰豆、牛油果加入攪拌機，攪成漿狀後加入粟米粒再次攪勻，製成豆醬備用。",
    							"2. 在墨西哥餅上舖上生菜、番茄、芝士，並以黑胡椒調味，最後舖上一小層豆醬，用牛油紙捲起，切成兩半即可。"},
    				{"菜名:	黑松露雜菇飯",
    							"材料:	秀珍菇(清洗後切碎)、鮮冬菇(清洗後切碎)、茶樹菇(清洗後切碎)、蘑菇(清洗後切碎)、雞髀菇(清洗後切碎)、印度米、燕麥飯",
    							"調味:	牛油、黑松露醬、上湯、胡椒粉、鹽",
    							"做法:	1. 燒熱油鑊，放入秀珍菇、鮮冬菇、茶樹菇、蘑菇、雞髀菇，封蓋焗香。",
    							"2. 將印度米、燕麥飯落鑊，加上湯一併兜炒，並以胡椒粉、鹽及黑松露醬調味，封蓋煮熟米飯。",
    							"3. 揭蓋後加入牛油、黑松露醬調味撈勻，上碟即可。"},
    				{"菜名:	桂花糖鮮淮山",
    							"材料:	鮮淮山(切段)、桂花",
    							"調味:	砂糖、麥芽糖",
    							"做法:	1. 將糖、桂花一併煮熱，再加麥芽糖煮溶，製成桂花蜜。",
    							"2. 把淮山放入煲中，隔水蒸十五分鐘，拿起後再切成小段，將桂花蜜黏在淮山頂端，放入雪櫃冷卻即可。"},
    				};
                imageid = new int[]{R.drawable.image17_1, R.drawable.image17_2, R.drawable.image17_3, R.drawable.image17_4};
            break;
                    
            case 17:
               recipes = new String[][]{		
    				{"菜名:	粉葛腰果養生湯",
    							"材料:	粉葛、紅蘿蔔、腰果、馬蹄(先切片浸發)、粟子、水",
    							"做法:	放下粟子、腰果、粉葛、紅蘿蔔、馬蹄，加水煲滾即可。"},
    				{"菜名:	七彩炒粉絲",
    							"材料:	粉絲、三色橙籠椒(切絲)、紅尖椒(切絲)、紹菜(切絲)、紅蘿蔔(切絲)、雞蛋絲、蔥頭(切絲)",
    							"調味:	麻油、鹽、冬菇粉、胡椒粉",
    							"做法:	1. 燒熱油鑊，爆香蔥頭絲，加入蘿蔔絲、青椒絲、黃椒絲、紅椒絲、紹菜絲兜炒，加鹽、冬菇粉調味。",
    							"2. 加入粉絲快速兜炒，加入麻油、胡椒粉調味，再次兜炒後上碟即可。"},
    				{"菜名:	金玉滿堂",
    							"材料:	黃心番薯(預先烚熟)、麵包糠、芝士、雞蛋",
    							"調味:	芝士粉、鹽",
    							"做法:	1. 用鹽、芝士粉為番薯蓉調味，加入麵包糠與雞蛋拌勻。",
    							"2. 將芝士片撕成幾小片，摺成球狀；將番薯蓉搓成球狀，把芝士球釀入番薯蓉中心，然後蘸上麵包糠，放入雪櫃放涼片刻。",
    							"3. 將番薯球放入油鑊炸熟，上碟即可。"},
    				{"菜名:	抹茶豆腐芝士蛋糕",
    							"材料:	滑豆腐190克、忌廉芝士100克、魚膠粉10克(用熱水灼溶)、忌廉125克、蛋糕片、紅豆蓉",
    							"調味:	抹茶粉2茶匙、砂糖50克",
    							"做法:	1. 先將忌廉芝士與砂糖打起，加入豆腐、魚膠粉、抺茶粉撈勻。",
    							"2. 將抹茶忌廉芝士與鮮忌廉輕輕拌勻；將蛋糕片放入蛋糕盤中，將忌廉芝士倒在蛋糕片上。",
    							"3. 將紅豆蓉與忌廉拌勻，輕輕舖一層在忌廉芝士上；將蛋糕放入雪櫃雪硬，最後隨喜好加入生果伴碟即可"},
    				};
               imageid = new int[]{R.drawable.image18_1, R.drawable.image18_2, R.drawable.image18_3, R.drawable.image18_4};
           break;
                   
           case 18:
               recipes = new String[][]{		
    				{"菜名:	翠綠蝦球",
    							"材料:	急凍蝦肉、蔥粒、薑末、芫荽粒、小棠菜粒、雞蛋一隻",
    							"調味:	生粉兩湯匙、鹽、胡椒粉",
    							"做法:	1. 將蝦肉、蔥粒、芫荽粒、薑末撈勻，並以鹽及胡椒粉調味。",
    							"2. 將蝦肉撻至起膠，加入雞蛋、小棠菜粒、麵粉拌勻",
    							"3. 燒熱油鑊，將蝦肉球炸熟，上碟即可。"},
    				{"菜名:	芝士蝦煲",
    							"材料:	海中蝦、芝士片4-5塊、麵粉",
    							"調味:	牛油、雞湯、紹興酒、胡椒粉",
    							"做法:	1. 先用生粉撈勻中蝦，然後放落油鑊煎熱，期間加入牛油煎熟。",
    							"2. 放少許麵粉、上湯、紹興酒、胡椒粉調味，最後加入芝士煮溶，上碟即可。"},
    				{"菜名:	泰式乾煎蝦碌",
    							"材料:	鮮蝦、薑(切絲)、蔥(切段)、芫荽",
    							"調味:	茄汁、泰式甜辣醬、是拉差辣椒醬",
    							"做法:	1. 燒熱油鑊，煎香薑絲、蔥條，令油鑊充滿薑、蔥香味，然後撈起材料。",
    							"2. 將鮮蝦放入油鑊煎紅，撈起備用。",
    							"3. 將泰式甜辣醬、茄汁、是拉差辣椒醬煮熱，加鹽調味，放入蔥段、芫荽及蝦一起兜炒，上碟即可。"},
    				{"菜名:	椰汁粟米糕",
    							"材料:	粟米粒",
    							"調味:	椰漿一杯、花奶一杯、粟粉一杯、砂糖半杯至大半杯、水一杯",
    							"做法:	1. 將水與粟粉拌勻，期間加入花奶、砂糖繼續攪拌，開火煮溶砂糖及粟粉。",
    							"2. 將糖水煮稠後，加入椰漿及粟米粒煮熱，倒入容器內，放入雪櫃冷卻即可。"},
    				};
               imageid = new int[]{R.drawable.image19_1, R.drawable.image19_2, R.drawable.image19_3, R.drawable.image19_4};
           break;
                   
           case 19:
               recipes = new String[][]{
    				{"菜名:	紙包骨",
    							"材料:	腩排",
    							"調味:	油、胡椒粉、豉油、糖、蠔油、紹興酒",
    							"做法:	1. 用油、胡椒粉、豉油、糖、蠔油、紹興酒醃好腩排，用蛋糕紙包實腩排。",
    							"2. 將紙包腩排放落油鑊炸熟，上碟即可。"},
    				{"菜名:	田雞飯",
    							"材料:	田雞、米、冬菇、紅棗、蔥",
    							"調味:	水、紹興酒、薑汁、生抽、油、鹽、糖、蒸魚豉油",
    							"做法:	1. 先煲好白飯；用紹興酒、油、鹽、薑汁、生抽、糖醃田雞，備用。",
    							"2. 白飯接近煲熟時，將田雞、冬菇、紅棗舖在飯面，蒸熟後放蔥，熟油、蒸魚豉油調味即可。"},
    				{"菜名:	缽仔蒸魚腸",
    							"材料:	魚腸、雞蛋、油條(切小段)、果皮(切絲)",
    							"調味:	紹興酒、薑汁、雞湯、鹽、胡椒粉、上湯",
    							"做法:	1. 先為魚腸去膏，剪開後加薑汁、紹興酒、鹽、豆粉清洗；再用薑汁、紹興酒、鹽、胡椒粉醃好魚腸，將魚腸放入缽仔中。",
    							"2. 打勻雞蛋，加入少許上湯、鹽調味，倒入砵仔中；將油條、果皮放入砵仔中，加入胡椒粉調味。",
    							"3. 將砵仔放入爐蒸十五分鐘，上碟即可。"},
    				{"菜名:	魚腸煎蛋",
    							"材料:	魚腸、油條、雞蛋兩隻",
    							"調味:	鹽、胡椒粉",
    							"做法:	將魚腸、油條、雞蛋拌勻，用鹽、胡椒粉調味。燒熱油鑊，倒入魚腸蛋漿煎熟成魚餅，上碟即可。"},
    				{"菜名:	水蒸蛋糕",
    							"材料:	蛋白一碗(4隻)、蛋黃一碗(4隻)",
    							"調味:	自發粉一碗、砂糖半碗、牛油少許、檸檬汁",
    							"做法:	1. 先打起蛋白，加入檸檬汁，備用；另將糖與蛋黃攪勻。",
    							"2. 將蛋白加入蛋黃中，倒入自發粉、牛油拌勻。",
    							"3. 將蛋漿倒入容器，蒸十分鐘後即可。"}
    		};
               imageid = new int[]{R.drawable.image20_1, R.drawable.image20_2, R.drawable.image20_3, R.drawable.image20_4,
    				R.drawable.image20_5};
          break;
         
        } //end switch
      }
		
		setContentView(R.layout.main_layout);
		// Create the adapter that will return a fragment for each of the three
		// primary sections of the activity.
		mSectionsPagerAdapter = new SectionsPagerAdapter(getSupportFragmentManager(), whichEpidso, whichSeries);

		// Set up the ViewPager with the sections adapter.
		mViewPager = (ViewPager) findViewById(R.id.pager);
		mViewPager.setAdapter(mSectionsPagerAdapter);
		
		adView = new AdView(this);
		adView.setAdUnitId("ca-app-pub-3929736155927907/5768812675");
		adView.setAdSize(AdSize.SMART_BANNER);
		
		ll = (LinearLayout)findViewById(R.id.layout_recipe);
		
		AdRequest adRequest = new AdRequest.Builder().build();
		
		adView.setBackgroundColor(Color.TRANSPARENT);
		adView.loadAd(adRequest);
		
		adView.setAdListener(new AdListener()
	    {
	    	@Override
	    	public void onAdLoaded()
	    	{
	    		if(firstTime)
	    		{
	    			firstTime = false;
	    			ll.addView(adView);
	    		}
	    	}
	    });
	}
	
	public void onDestroy() {
        if (adView != null) {
            adView.destroy();
        }
        this.finish();
        super.onDestroy();
    }

    public void onPause() {
        if (adView != null) {
            adView.pause();
        }
        super.onPause();
    }

    public void onResume() {
        super.onResume();
        if (adView != null) {
            adView.resume();
        }
    }

	/**
	 * A {@link FragmentPagerAdapter} that returns a fragment corresponding to
	 * one of the sections/tabs/pages.
	 */
	public class SectionsPagerAdapter extends FragmentPagerAdapter {
		int index=0, seriesNo=0;

		public SectionsPagerAdapter(FragmentManager fm, int number, int series) {
			super(fm);
			index = number;
			seriesNo = series;
		}

		@Override
		public Fragment getItem(int position) {
			// getItem is called to instantiate the fragment for the given page.
			// Return a PlaceholderFragment (defined as a static inner class
			// below).
			//Toast.makeText(getApplicationContext(), String.valueOf(position), Toast.LENGTH_SHORT).show();
			return PlaceholderFragment.newInstance(position);
		}

		@Override
		public int getCount() {
			// Show 3 total pages.
			return numOfRecipes[seriesNo][index];
		}
		
		@Override
		public CharSequence getPageTitle(int position) {
			Locale l = Locale.getDefault();
			return (String.valueOf(position+1)+"/"+String.valueOf(numOfRecipes[seriesNo][index])).toUpperCase(l);
		}
		
	}

	/**
	 * A placeholder fragment containing a simple view.
	 */
	public static class PlaceholderFragment extends Fragment {
		/**
		 * The fragment argument representing the section number for this
		 * fragment.
		 */
		
		private static final String ARG_SECTION_NUMBER = "section_number";
		//private static final String EPIDSO_NUMBER = "epidso_number";
		/**
		 * Returns a new instance of this fragment for the given section number.
		 */
		public static PlaceholderFragment newInstance(int sectionNumber) {
			PlaceholderFragment fragment = new PlaceholderFragment();
			Bundle args = new Bundle();
			args.putInt(ARG_SECTION_NUMBER, sectionNumber);
			fragment.setArguments(args);
			return fragment;
		}

		public PlaceholderFragment() {
		}

		@Override
		public View onCreateView(LayoutInflater inflater, ViewGroup container,
				Bundle savedInstanceState) {
			View rootView = inflater.inflate(R.layout.fragment_layout,
					container, false);
			final int cur = getArguments().getInt(ARG_SECTION_NUMBER);	//which recipe
			//final int recipe = getArguments().getInt(EPIDSO_NUMBER);
			ImageView iv = (ImageView)rootView.findViewById(R.id.imageview);
			
			ListView lv = (ListView) rootView.findViewById(R.id.listview);
			List<String>list = new ArrayList<String>();
			
			iv.setImageResource(imageid[cur]);
			for(int i=0; i<recipes[cur].length; i++){
				list.add(recipes[cur][i]);
			}
			
			ArrayAdapter<String> adapter = new ArrayAdapter<String>(rootView.getContext(), android.R.layout.simple_list_item_1, list);
			
			iv.setOnClickListener(new ImageView.OnClickListener(){

				@Override
				public void onClick(View v) {
					Intent fsIntent = new Intent();
					Bundle fsBundle = new Bundle();
					fsIntent.setClass(getActivity(), EnlargeActivity.class);
					fsBundle.putInt("Image", imageid[cur]);
					
					fsBundle.putInt("title", whichSeries);
					fsIntent.putExtras(fsBundle);
					startActivityForResult(fsIntent,0);
				}
				
			});
			
			lv.setAdapter(adapter);
			return rootView;
		}
	}
}
